-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Máy chủ: 127.0.0.1
-- Thời gian đã tạo: Th5 15, 2025 lúc 03:13 PM
-- Phiên bản máy phục vụ: 10.4.32-MariaDB
-- Phiên bản PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Cơ sở dữ liệu: `whr_bookshop`
--

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `banner_advertisings`
--

CREATE TABLE `banner_advertisings` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `image` text NOT NULL,
  `status` enum('active','no_active') NOT NULL DEFAULT 'active',
  `position` enum('homepage','sidebar','footer','top_homepage') NOT NULL DEFAULT 'homepage',
  `is_deleted` tinyint(1) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `brands`
--

CREATE TABLE `brands` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `brand_name` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `country` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `brands`
--

INSERT INTO `brands` (`id`, `brand_name`, `description`, `country`, `created_at`, `updated_at`) VALUES
(1, 'Thiên Long', 'Thương hiệu văn phòng phẩm hàng đầu Việt Nam, chuyên sản xuất bút viết, dụng cụ học tập và văn phòng.', NULL, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(2, 'Hồng Hà', 'Thương hiệu nổi tiếng với các sản phẩm tập vở, giấy và dụng cụ học sinh chất lượng cao.', NULL, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(3, 'Elephant', 'Thương hiệu văn phòng phẩm nổi tiếng từ Thái Lan, chuyên về dụng cụ bấm kim, kéo, dao rọc giấy.', NULL, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(4, 'Pilot', 'Thương hiệu Nhật Bản chuyên về bút cao cấp như bút gel, bút máy, bút bi và bút lông dầu.', NULL, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(5, 'Deli', 'Hãng văn phòng phẩm đến từ Trung Quốc, cung cấp đa dạng sản phẩm từ bút viết, dụng cụ văn phòng đến balo và túi xách.', NULL, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(6, 'Pentel', 'Thương hiệu Nhật Bản chuyên về bút lông, bút chì kim, màu vẽ và các sản phẩm sáng tạo.', NULL, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(7, 'Campus', 'Thương hiệu vở viết và sổ ghi chép cao cấp từ Nhật Bản, nổi tiếng với chất lượng giấy tốt.', NULL, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(8, 'Zebra', 'Hãng bút Nhật Bản nổi tiếng với các dòng bút bi, bút lông kim và bút highlight chất lượng cao.', NULL, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(9, 'Plus', 'Thương hiệu văn phòng phẩm Nhật Bản chuyên về kéo, dao rọc giấy, bấm kim và các sản phẩm hỗ trợ văn phòng.', NULL, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(10, 'Milan', 'Thương hiệu Tây Ban Nha chuyên về tẩy, bút chì, dụng cụ vẽ và sáng tạo cho học sinh và nghệ sĩ.', NULL, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(11, 'Crown', 'Thương hiệu văn phòng phẩm từ Hàn Quốc, chuyên về bút bi, bút gel và các dụng cụ học tập khác.', NULL, '2025-05-15 05:49:58', '2025-05-15 05:49:58');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `carts`
--

CREATE TABLE `carts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `product_id` bigint(20) UNSIGNED DEFAULT NULL,
  `quantity` int(11) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `carts`
--

INSERT INTO `carts` (`id`, `user_id`, `product_id`, `quantity`, `created_at`, `updated_at`) VALUES
(1, 8, 4, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(2, 1, 28, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(3, 52, 25, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(4, 18, 26, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(5, 21, 39, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(6, 38, 40, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(7, 22, 4, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(8, 42, 43, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(9, 41, 24, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(10, 30, 3, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(11, 12, 44, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(12, 34, 9, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(13, 2, 18, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(14, 11, 20, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(15, 52, 8, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(16, 37, 21, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(17, 8, 43, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(18, 37, 2, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(19, 16, 30, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(20, 2, 4, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(21, 21, 24, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(22, 30, 33, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(23, 47, 16, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(24, 8, 27, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(25, 14, 41, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(26, 17, 30, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(27, 46, 11, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(28, 21, 2, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(29, 24, 10, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(30, 43, 35, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(31, 46, 9, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(32, 9, 43, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(33, 17, 12, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(34, 33, 42, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(35, 11, 14, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(36, 23, 3, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(37, 24, 20, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(38, 34, 44, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(39, 27, 14, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(40, 31, 19, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(41, 50, 43, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(42, 47, 29, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(43, 22, 34, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(44, 34, 23, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(45, 40, 36, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(46, 52, 5, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(47, 50, 27, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(48, 24, 37, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(49, 48, 12, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(50, 2, 41, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(51, 25, 5, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(52, 31, 9, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(53, 28, 17, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(54, 24, 18, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(55, 38, 25, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(56, 6, 15, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(57, 17, 15, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(58, 38, 16, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(59, 47, 35, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(60, 48, 1, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(61, 31, 37, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(62, 14, 31, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(63, 11, 25, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(64, 12, 1, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(65, 28, 44, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(66, 42, 42, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(67, 25, 42, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(68, 24, 22, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(69, 13, 39, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(70, 14, 34, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(71, 11, 16, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(72, 35, 26, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(73, 33, 13, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(74, 29, 22, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(75, 21, 21, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(76, 13, 11, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(77, 35, 10, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(78, 29, 3, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(79, 33, 22, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(80, 46, 26, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(81, 3, 37, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(82, 29, 26, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(83, 39, 31, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(84, 19, 26, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(85, 19, 39, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(86, 45, 42, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(87, 18, 25, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(88, 28, 34, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(89, 20, 32, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(90, 25, 32, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(91, 5, 24, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(92, 50, 29, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(93, 11, 25, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(94, 22, 13, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(95, 6, 7, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(96, 52, 32, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(97, 19, 7, 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(98, 4, 22, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(99, 16, 9, 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(100, 2, 31, 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `catalogs`
--

CREATE TABLE `catalogs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `catalog_name` varchar(255) NOT NULL,
  `description` varchar(255) DEFAULT NULL,
  `catalog_image` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `catalogs`
--

INSERT INTO `catalogs` (`id`, `catalog_name`, `description`, `catalog_image`, `created_at`, `updated_at`) VALUES
(1, 'Kinh dị', 'Các ấn phẩm về thể loại huyền bí, giả tưởng và kinh dị, đem lại cảm giác ly kỳ và bất ngờ cho người đọc.', 'https://res.cloudinary.com/whr-clound/image/upload/v1745382857/read7wln5tknurwd3gbe.webp', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(2, 'Truyện thiếu nhi', 'Các loại truyện dành cho thiếu nhi, phù hợp với mọi độ tuổi, giúp phát triển trí tưởng tượng và giáo dục nhân cách.', 'https://res.cloudinary.com/whr-clound/image/upload/v1745382856/oelmbfstzjqxtofw258h.webp', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(3, 'Truyện ngắn', 'Tuyển tập các truyện ngắn và tản văn nhẹ nhàng, sâu sắc về cuộc sống và con người.', 'https://res.cloudinary.com/whr-clound/image/upload/v1745382856/ibqr9gzycc4bziprefab.webp', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(4, 'Trinh thám', 'Các câu chuyện trinh thám ly kỳ, với những màn điều tra và phá án đầy lôi cuốn.', 'https://res.cloudinary.com/whr-clound/image/upload/v1745382857/zhhkrx07vx0ot26tu64d.webp', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(5, 'Truyện cười', 'Truyện cười và truyện hài hước, mang lại tiếng cười và giây phút thư giãn cho người đọc.', 'https://res.cloudinary.com/whr-clound/image/upload/v1745382858/c2jzshdpxsplk1uhufag.webp', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(6, 'Tiểu thuyết', 'Các tiểu thuyết thuộc nhiều thể loại, từ tình cảm, lãng mạn đến phiêu lưu và hành động.', 'https://res.cloudinary.com/whr-clound/image/upload/v1745382857/rd9ell3b21ddvzwo5wvy.webp', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(7, 'Chính trị', 'Các ấn phẩm về chính trị, pháp lý và triết học, cung cấp kiến thức và cái nhìn sâu sắc về xã hội, luật pháp và tư tưởng.', 'https://res.cloudinary.com/whr-clound/image/upload/v1745382857/vzbsvzx6zi6aqiumlzrs.jpg', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(8, 'Văn hóa', 'Các tài liệu về văn hóa, nghệ thuật và du lịch, giúp mở rộng kiến thức và khám phá vẻ đẹp của thế giới.', 'https://res.cloudinary.com/whr-clound/image/upload/v1745382858/niogqjqfzi00clqcriux.webp', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(9, 'Kinh tế', 'Các sách và tài liệu về kinh tế, tài chính và quản lý, cung cấp kiến thức cho người học và các chuyên gia trong lĩnh vực này.', 'https://res.cloudinary.com/whr-clound/image/upload/v1745382857/iatnueyzmwcltgl7ycm6.webp', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(10, 'Bút - Viết', 'Dụng cụ hỗ trợ viết lách, ký kết và vẽ, mang lại sự chính xác và tinh tế trong từng nét chữ.', 'https://res.cloudinary.com/whr-clound/image/upload/v1745382856/wust9jchpduntt5djnli.webp', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(11, 'Dụng cụ văn phòng', 'Các sản phẩm hỗ trợ công việc hàng ngày, đảm bảo hiệu quả và tổ chức trong môi trường làm việc.', 'https://res.cloudinary.com/whr-clound/image/upload/v1745382856/derzx9nctvewsl3ohl3b.webp', '2025-05-15 05:49:58', '2025-05-15 05:49:58');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `customer_addresses`
--

CREATE TABLE `customer_addresses` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `username` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `province` varchar(255) DEFAULT NULL,
  `district` varchar(255) DEFAULT NULL,
  `ward` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `default_address` tinyint(1) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `customer_addresses`
--

INSERT INTO `customer_addresses` (`id`, `user_id`, `username`, `phone`, `province`, `district`, `ward`, `address`, `default_address`, `created_at`, `updated_at`) VALUES
(1, 2, 'Nguyễn Quang Huy', '0987654321', 'Hồ Chí Minh', 'Quận 12', 'Trung Mỹ Tây', '99/3/3a', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `feedbacks`
--

CREATE TABLE `feedbacks` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `type` varchar(255) NOT NULL,
  `content` text NOT NULL,
  `image` varchar(255) DEFAULT NULL,
  `status` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `feedback_answers`
--

CREATE TABLE `feedback_answers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `feedback_id` bigint(20) UNSIGNED DEFAULT NULL,
  `answer` text NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `flashsales`
--

CREATE TABLE `flashsales` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED DEFAULT NULL,
  `discount_price` decimal(10,2) NOT NULL,
  `quantity` int(11) NOT NULL,
  `start_date` date NOT NULL,
  `end_date` date NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `flashsales`
--

INSERT INTO `flashsales` (`id`, `product_id`, `discount_price`, `quantity`, `start_date`, `end_date`, `created_at`, `updated_at`) VALUES
(1, 33, 18.00, 12, '2025-05-10', '2025-05-17', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(2, 17, 17.00, 32, '2025-04-21', '2025-05-13', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(3, 32, 7.00, 26, '2025-05-03', '2025-05-12', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(4, 12, 23.00, 33, '2025-04-25', '2025-05-18', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(5, 14, 18.00, 25, '2025-04-20', '2025-06-06', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(6, 44, 29.00, 47, '2025-05-31', '2025-06-13', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(7, 25, 11.00, 24, '2025-04-29', '2025-06-14', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(8, 36, 26.00, 30, '2025-04-17', '2025-05-25', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(9, 7, 2.00, 45, '2025-06-06', '2025-06-07', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(10, 41, 24.00, 39, '2025-04-30', '2025-06-10', '2025-05-15 05:49:58', '2025-05-15 05:49:58');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(2, '2025_02_19_072704_create_users_table', 1),
(3, '2025_02_19_072740_create_policies_table', 1),
(4, '2025_02_19_072805_create_catalogs_table', 1),
(5, '2025_02_19_072826_create_brands_table', 1),
(6, '2025_02_19_072849_create_suppliers_table', 1),
(7, '2025_02_19_072924_create_ratings_table', 1),
(8, '2025_02_19_072947_create_products_table', 1),
(9, '2025_02_19_073012_create_product_details_table', 1),
(10, '2025_02_19_073045_create_product_attributes_table', 1),
(11, '2025_02_19_073107_create_flashsales_table', 1),
(12, '2025_02_19_073126_create_carts_table', 1),
(13, '2025_02_19_073145_create_orders_table', 1),
(14, '2025_02_19_073153_create_order_details_table', 1),
(15, '2025_02_19_073222_create_order_shipping_address_table', 1),
(16, '2025_02_19_074542_create_vouchers_table', 1),
(17, '2025_02_19_074544_create_user_vouchers_table', 1),
(18, '2025_04_09_031040_create_customer_address_table', 1),
(19, '2025_04_13_151750_create_o_p_t_verifies_table', 1),
(20, '2025_04_17_101933_create_special_events_table', 1),
(21, '2025_04_17_105851_create_special_event_de_tails_table', 1),
(22, '2025_04_19_135939_create_order_reviews_table', 1),
(23, '2025_04_19_141553_create_product_review_table', 1),
(24, '2025_04_21_072105_create_feedback_table', 1),
(25, '2025_04_21_072522_create_feedbac_answers_table', 1),
(26, '2025_04_21_154626_create_vnpay_payments_table', 1),
(27, '2025_05_02_014324_create_banner_advertisings_table', 1);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `orders`
--

CREATE TABLE `orders` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `total_price` decimal(10,2) NOT NULL,
  `shipping_fee` decimal(10,2) NOT NULL,
  `payment_method` varchar(255) NOT NULL DEFAULT 'Tiền mặt',
  `is_payment` tinyint(1) NOT NULL DEFAULT 0,
  `status` enum('Chờ xác nhận','Chuẩn bị hàng','Đang giao hàng','Đã giao hàng') NOT NULL DEFAULT 'Chờ xác nhận',
  `order_date` date NOT NULL DEFAULT '2025-05-15',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `orders`
--

INSERT INTO `orders` (`id`, `user_id`, `total_price`, `shipping_fee`, `payment_method`, `is_payment`, `status`, `order_date`, `created_at`, `updated_at`) VALUES
(1, 25, 329000.00, 23000.00, 'Tiền mặt', 0, 'Chuẩn bị hàng', '2025-04-17', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(2, 24, 615200.00, 23000.00, 'Tiền mặt', 0, 'Chuẩn bị hàng', '2025-04-17', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(3, 33, 549500.00, 23000.00, 'VNPAY', 0, 'Đang giao hàng', '2025-05-11', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(4, 21, 536000.00, 23000.00, 'Tiền mặt', 0, 'Chờ xác nhận', '2025-04-19', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(5, 36, 1242800.00, 23000.00, 'MoMo', 0, 'Chuẩn bị hàng', '2025-05-05', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(6, 5, 177800.00, 23000.00, 'VNPAY', 0, 'Đã giao hàng', '2025-04-23', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(7, 42, 443300.00, 23000.00, 'VNPAY', 0, 'Chờ xác nhận', '2025-05-12', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(8, 28, 732900.00, 23000.00, 'MoMo', 0, 'Chuẩn bị hàng', '2025-04-25', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(9, 9, 45500.00, 23000.00, 'MoMo', 0, 'Chuẩn bị hàng', '2025-05-08', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(10, 22, 378500.00, 23000.00, 'VNPAY', 0, 'Chuẩn bị hàng', '2025-04-21', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(11, 37, 36500.00, 23000.00, 'Tiền mặt', 0, 'Chuẩn bị hàng', '2025-04-27', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(12, 30, 122900.00, 23000.00, 'Tiền mặt', 0, 'Chuẩn bị hàng', '2025-04-16', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(13, 46, 360500.00, 23000.00, 'Tiền mặt', 0, 'Chuẩn bị hàng', '2025-05-04', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(14, 39, 545000.00, 23000.00, 'Tiền mặt', 0, 'Đang giao hàng', '2025-04-18', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(15, 11, 370400.00, 23000.00, 'MoMo', 0, 'Chờ xác nhận', '2025-04-25', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(16, 17, 524800.00, 23000.00, 'VNPAY', 0, 'Đã giao hàng', '2025-05-12', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(17, 11, 179600.00, 23000.00, 'VNPAY', 0, 'Đang giao hàng', '2025-04-19', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(18, 14, 696100.00, 23000.00, 'MoMo', 0, 'Chuẩn bị hàng', '2025-04-27', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(19, 27, 693500.00, 23000.00, 'VNPAY', 0, 'Chuẩn bị hàng', '2025-05-15', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(20, 30, 763300.00, 23000.00, 'VNPAY', 0, 'Chuẩn bị hàng', '2025-05-10', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(21, 4, 308000.00, 23000.00, 'MoMo', 0, 'Đang giao hàng', '2025-04-17', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(22, 43, 744500.00, 23000.00, 'Tiền mặt', 0, 'Đang giao hàng', '2025-04-17', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(23, 45, 216500.00, 23000.00, 'VNPAY', 0, 'Chuẩn bị hàng', '2025-04-20', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(24, 6, 432500.00, 23000.00, 'VNPAY', 0, 'Chờ xác nhận', '2025-05-04', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(25, 46, 405500.00, 23000.00, 'MoMo', 0, 'Chuẩn bị hàng', '2025-05-13', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(26, 51, 158000.00, 23000.00, 'Tiền mặt', 0, 'Chuẩn bị hàng', '2025-05-04', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(27, 12, 45500.00, 23000.00, 'VNPAY', 0, 'Chờ xác nhận', '2025-04-21', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(28, 26, 104000.00, 23000.00, 'MoMo', 0, 'Chuẩn bị hàng', '2025-05-01', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(29, 25, 396500.00, 23000.00, 'Tiền mặt', 0, 'Chờ xác nhận', '2025-04-20', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(30, 13, 106600.00, 23000.00, 'Tiền mặt', 0, 'Chuẩn bị hàng', '2025-04-25', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(31, 11, 183200.00, 23000.00, 'Tiền mặt', 0, 'Chuẩn bị hàng', '2025-05-05', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(32, 7, 155100.00, 23000.00, 'MoMo', 0, 'Đang giao hàng', '2025-04-18', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(33, 12, 36500.00, 23000.00, 'Tiền mặt', 0, 'Đã giao hàng', '2025-05-04', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(34, 13, 653000.00, 23000.00, 'MoMo', 0, 'Đang giao hàng', '2025-04-26', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(35, 3, 194000.00, 23000.00, 'VNPAY', 0, 'Đang giao hàng', '2025-05-10', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(36, 9, 357400.00, 23000.00, 'MoMo', 0, 'Đang giao hàng', '2025-04-26', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(37, 49, 675500.00, 23000.00, 'Tiền mặt', 0, 'Chuẩn bị hàng', '2025-04-21', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(38, 24, 685400.00, 23000.00, 'Tiền mặt', 0, 'Chuẩn bị hàng', '2025-05-13', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(39, 52, 86000.00, 23000.00, 'Tiền mặt', 0, 'Đã giao hàng', '2025-04-22', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(40, 37, 239000.00, 23000.00, 'VNPAY', 0, 'Đã giao hàng', '2025-05-02', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(41, 20, 77000.00, 23000.00, 'VNPAY', 0, 'Chờ xác nhận', '2025-05-10', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(42, 21, 569750.00, 23000.00, 'Tiền mặt', 0, 'Chuẩn bị hàng', '2025-05-05', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(43, 27, 482000.00, 23000.00, 'MoMo', 0, 'Chuẩn bị hàng', '2025-05-09', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(44, 6, 37400.00, 23000.00, 'MoMo', 0, 'Chờ xác nhận', '2025-05-11', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(45, 24, 441000.00, 23000.00, 'VNPAY', 0, 'Đã giao hàng', '2025-05-04', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(46, 10, 324500.00, 23000.00, 'Tiền mặt', 0, 'Chờ xác nhận', '2025-04-30', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(47, 2, 293000.00, 23000.00, 'VNPAY', 0, 'Đã giao hàng', '2025-04-21', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(48, 12, 247400.00, 23000.00, 'VNPAY', 0, 'Chuẩn bị hàng', '2025-04-25', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(49, 12, 1059500.00, 23000.00, 'MoMo', 0, 'Chờ xác nhận', '2025-05-11', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(50, 17, 176000.00, 23000.00, 'VNPAY', 0, 'Đã giao hàng', '2025-05-06', '2025-05-15 05:49:59', '2025-05-15 05:49:59');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `order_details`
--

CREATE TABLE `order_details` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `order_id` bigint(20) UNSIGNED DEFAULT NULL,
  `product_id` bigint(20) UNSIGNED DEFAULT NULL,
  `quantity` int(11) NOT NULL,
  `price` decimal(10,2) NOT NULL,
  `total` decimal(10,2) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `order_details`
--

INSERT INTO `order_details` (`id`, `order_id`, `product_id`, `quantity`, `price`, `total`, `created_at`, `updated_at`) VALUES
(1, 1, 10, 4, 58500.00, 234000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(2, 1, 43, 2, 36000.00, 72000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(3, 2, 17, 5, 58500.00, 292500.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(4, 2, 45, 1, 11700.00, 11700.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(5, 2, 21, 4, 72000.00, 288000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(6, 3, 25, 5, 58500.00, 292500.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(7, 3, 17, 4, 58500.00, 234000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(8, 4, 42, 2, 184500.00, 369000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(9, 4, 8, 2, 72000.00, 144000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(10, 5, 18, 1, 76500.00, 76500.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(11, 5, 11, 3, 73600.00, 220800.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(12, 5, 42, 5, 184500.00, 922500.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(13, 6, 39, 3, 3600.00, 10800.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(14, 6, 21, 2, 72000.00, 144000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(15, 7, 24, 5, 45000.00, 225000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(16, 7, 12, 3, 65100.00, 195300.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(17, 8, 15, 1, 67500.00, 67500.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(18, 8, 3, 5, 83600.00, 418000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(19, 8, 5, 3, 74800.00, 224400.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(20, 9, 33, 5, 4500.00, 22500.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(21, 10, 23, 1, 85500.00, 85500.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(22, 10, 20, 4, 67500.00, 270000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(23, 11, 34, 1, 13500.00, 13500.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(24, 12, 37, 3, 33300.00, 99900.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(25, 13, 15, 5, 67500.00, 337500.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(26, 14, 28, 4, 81000.00, 324000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(27, 14, 24, 2, 45000.00, 90000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(28, 14, 43, 3, 36000.00, 108000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(29, 15, 45, 2, 11700.00, 23400.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(30, 15, 32, 4, 81000.00, 324000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(31, 16, 45, 3, 11700.00, 35100.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(32, 16, 13, 4, 72800.00, 291200.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(33, 16, 25, 3, 58500.00, 175500.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(34, 17, 40, 4, 39150.00, 156600.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(35, 18, 45, 3, 11700.00, 35100.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(36, 18, 11, 5, 73600.00, 368000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(37, 18, 20, 4, 67500.00, 270000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(38, 19, 20, 3, 67500.00, 202500.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(39, 19, 10, 3, 58500.00, 175500.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(40, 19, 17, 5, 58500.00, 292500.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(41, 20, 5, 5, 74800.00, 374000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(42, 20, 38, 5, 34200.00, 171000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(43, 20, 12, 3, 65100.00, 195300.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(44, 21, 14, 5, 57000.00, 285000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(45, 22, 22, 3, 76500.00, 229500.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(46, 22, 29, 4, 72000.00, 288000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(47, 22, 6, 4, 51000.00, 204000.00, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(48, 23, 25, 1, 58500.00, 58500.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(49, 23, 27, 2, 67500.00, 135000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(50, 24, 16, 1, 63000.00, 63000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(51, 24, 4, 1, 54000.00, 54000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(52, 24, 17, 5, 58500.00, 292500.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(53, 25, 22, 5, 76500.00, 382500.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(54, 26, 27, 2, 67500.00, 135000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(55, 27, 33, 5, 4500.00, 22500.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(56, 28, 19, 1, 81000.00, 81000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(57, 29, 15, 3, 67500.00, 202500.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(58, 29, 38, 5, 34200.00, 171000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(59, 30, 3, 1, 83600.00, 83600.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(60, 31, 35, 2, 21600.00, 43200.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(61, 31, 25, 2, 58500.00, 117000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(62, 32, 25, 1, 58500.00, 58500.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(63, 32, 11, 1, 73600.00, 73600.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(64, 33, 34, 1, 13500.00, 13500.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(65, 34, 26, 2, 63000.00, 126000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(66, 34, 28, 4, 81000.00, 324000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(67, 34, 43, 5, 36000.00, 180000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(68, 35, 23, 2, 85500.00, 171000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(69, 36, 3, 4, 83600.00, 334400.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(70, 37, 30, 5, 76500.00, 382500.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(71, 37, 27, 4, 67500.00, 270000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(72, 38, 4, 4, 54000.00, 216000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(73, 38, 5, 4, 74800.00, 299200.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(74, 38, 11, 2, 73600.00, 147200.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(75, 39, 7, 1, 63000.00, 63000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(76, 40, 4, 2, 54000.00, 108000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(77, 40, 43, 3, 36000.00, 108000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(78, 41, 24, 1, 45000.00, 45000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(79, 41, 33, 2, 4500.00, 9000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(80, 42, 40, 3, 39150.00, 117450.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(81, 42, 12, 3, 65100.00, 195300.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(82, 42, 17, 4, 58500.00, 234000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(83, 43, 37, 5, 33300.00, 166500.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(84, 43, 17, 5, 58500.00, 292500.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(85, 44, 39, 4, 3600.00, 14400.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(86, 45, 3, 5, 83600.00, 418000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(87, 46, 27, 1, 67500.00, 67500.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(88, 46, 10, 4, 58500.00, 234000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(89, 47, 4, 5, 54000.00, 270000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(90, 48, 5, 3, 74800.00, 224400.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(91, 49, 14, 2, 57000.00, 114000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(92, 49, 42, 5, 184500.00, 922500.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(93, 50, 19, 1, 81000.00, 81000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(94, 50, 8, 1, 72000.00, 72000.00, '2025-05-15 05:49:59', '2025-05-15 05:49:59');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `order_reviews`
--

CREATE TABLE `order_reviews` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `order_id` bigint(20) UNSIGNED DEFAULT NULL,
  `rating_id` bigint(20) UNSIGNED DEFAULT NULL,
  `comment` text DEFAULT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `order_shipping_addresses`
--

CREATE TABLE `order_shipping_addresses` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `order_id` bigint(20) UNSIGNED DEFAULT NULL,
  `full_name` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `province` varchar(255) NOT NULL,
  `district` varchar(255) NOT NULL,
  `ward` varchar(255) NOT NULL,
  `address_line1` varchar(255) NOT NULL,
  `address_line2` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `order_shipping_addresses`
--

INSERT INTO `order_shipping_addresses` (`id`, `order_id`, `full_name`, `phone`, `province`, `district`, `ward`, `address_line1`, `address_line2`, `created_at`, `updated_at`) VALUES
(1, 1, 'Petra Fay', '0650367521', 'Hồ Chí Minh', 'Quận 7', 'Phường Thảo Điền', '81581 Helena Harbor', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(2, 2, 'Arnaldo Koch', '0429624354', 'Hà Nội', 'Quận Bình Thạnh', 'Phường An Phú', '843 Howe Islands', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(3, 3, 'Kurt Bednar', '0213767459', 'Đà Nẵng', 'Quận 3', 'Phường Tân Định', '75136 Hosea Pass Suite 072', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(4, 4, 'Jane Walker', '0764954122', 'Huế', 'Quận Bình Thạnh', 'Phường An Phú', '478 Medhurst Circle', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(5, 5, 'Demarcus Ratke', '0242536270', 'Đà Nẵng', 'Quận 5', 'Phường Cầu Kho', '85941 Yesenia Glen Apt. 708', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(6, 6, 'Jules Cronin', '0201097883', 'Hà Nội', 'Quận 1', 'Phường Tân Định', '9362 Quigley Causeway Suite 890', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(7, 7, 'Cathrine Wolff', '0494122830', 'Cần Thơ', 'Quận 7', 'Phường An Phú', '779 Rebecca Centers', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(8, 8, 'Nicolas Orn', '0106381557', 'Huế', 'Quận 1', 'Phường Thảo Điền', '454 Norwood Brook Suite 865', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(9, 9, 'Paolo Murray', '0163730666', 'Đà Nẵng', 'Quận Bình Thạnh', 'Phường Cầu Kho', '990 Cummings Heights', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(10, 10, 'Stevie Shanahan', '0720565619', 'Cần Thơ', 'Quận 1', 'Phường Tân Định', '832 Tracey Club Apt. 881', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(11, 11, 'Madisyn Wintheiser', '0463458770', 'Cần Thơ', 'Quận 7', 'Phường Tân Định', '87387 Predovic Streets', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(12, 12, 'Brain Robel', '0901034744', 'Cần Thơ', 'Quận 7', 'Phường Bến Nghé', '727 Metz Hill', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(13, 13, 'Estevan Grady', '0125221458', 'Huế', 'Quận 3', 'Phường Cầu Kho', '3338 Kihn Crest', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(14, 14, 'Jamie Grimes', '0289310738', 'Đà Nẵng', 'Quận 1', 'Phường Bến Nghé', '198 Markus Prairie Apt. 506', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(15, 15, 'Conrad Schuppe', '0569130148', 'Hồ Chí Minh', 'Quận 1', 'Phường Cầu Kho', '865 Kavon Wells Apt. 841', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(16, 16, 'Cesar Bosco', '0869742645', 'Hà Nội', 'Quận 1', 'Phường Bến Nghé', '64563 Bode Lake', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(17, 17, 'Armand Waelchi', '0655586642', 'Huế', 'Quận 1', 'Phường Tân Định', '367 Grant Springs', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(18, 18, 'Emile Barton', '0213905590', 'Đà Nẵng', 'Quận 5', 'Phường Bến Nghé', '45355 Kshlerin Via Suite 028', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(19, 19, 'Hannah Bahringer', '0447558092', 'Hà Nội', 'Quận 7', 'Phường Thảo Điền', '1690 Rashawn Underpass Suite 601', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(20, 20, 'Hans Casper', '0338331150', 'Hồ Chí Minh', 'Quận 1', 'Phường Tân Định', '8145 Gerlach Walk', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(21, 21, 'Donald Kilback', '0152902589', 'Cần Thơ', 'Quận Bình Thạnh', 'Phường Bến Nghé', '47229 Bayer Manor Suite 429', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(22, 22, 'Jaycee Murray', '0193655575', 'Hồ Chí Minh', 'Quận 7', 'Phường Thảo Điền', '7747 Rylan Plaza Suite 647', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(23, 23, 'Kristina Bauch', '0405902115', 'Hà Nội', 'Quận Bình Thạnh', 'Phường Bến Nghé', '223 Lavina Stream', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(24, 24, 'Bryce Parisian', '0727319391', 'Đà Nẵng', 'Quận Bình Thạnh', 'Phường Thảo Điền', '826 Amya Spring Suite 081', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(25, 25, 'Halie Mills', '0002178507', 'Đà Nẵng', 'Quận 7', 'Phường Tân Định', '9084 Hackett Villages Apt. 034', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(26, 26, 'Carson Will', '0571099889', 'Hà Nội', 'Quận Bình Thạnh', 'Phường Tân Định', '6972 Hagenes Corners', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(27, 27, 'Trinity Stark', '0537416484', 'Đà Nẵng', 'Quận 3', 'Phường An Phú', '97206 Winona Hills', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(28, 28, 'Alexie Haag', '0971866682', 'Đà Nẵng', 'Quận 1', 'Phường An Phú', '9524 Weissnat Garden Apt. 156', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(29, 29, 'Demarcus Hirthe', '0906815349', 'Hồ Chí Minh', 'Quận 3', 'Phường An Phú', '798 Rodriguez Road Apt. 448', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(30, 30, 'Tiffany Nicolas', '0909128686', 'Hà Nội', 'Quận 7', 'Phường An Phú', '97758 Ledner Port', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(31, 31, 'Martin Sporer', '0047229118', 'Hồ Chí Minh', 'Quận 3', 'Phường Tân Định', '46894 Ortiz Creek Suite 067', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(32, 32, 'Jaydon Marks', '0272409702', 'Hồ Chí Minh', 'Quận Bình Thạnh', 'Phường Thảo Điền', '43229 Sim Summit Suite 653', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(33, 33, 'Liza Schneider', '0122057878', 'Hồ Chí Minh', 'Quận 7', 'Phường Cầu Kho', '85234 Elmer Isle Apt. 108', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(34, 34, 'Deanna Purdy', '0445751295', 'Hà Nội', 'Quận Bình Thạnh', 'Phường Tân Định', '9657 Deonte Forest', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(35, 35, 'Laurence Bode', '0813903652', 'Hà Nội', 'Quận 5', 'Phường Thảo Điền', '1889 Hahn Village Suite 298', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(36, 36, 'Pedro Goyette', '0595943776', 'Cần Thơ', 'Quận 3', 'Phường Cầu Kho', '744 Roosevelt Mount', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(37, 37, 'Cristopher Bradtke', '0176876960', 'Đà Nẵng', 'Quận 1', 'Phường Thảo Điền', '7316 Abbott Rapid', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(38, 38, 'Sylvan Durgan', '0536221720', 'Huế', 'Quận 7', 'Phường An Phú', '64630 Ana Walk Suite 403', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(39, 39, 'Van Bauch', '0593155503', 'Cần Thơ', 'Quận 7', 'Phường Tân Định', '30220 Beer Plains', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(40, 40, 'Carolanne Block', '0158496278', 'Hồ Chí Minh', 'Quận 5', 'Phường Tân Định', '90412 Mossie Estates Apt. 117', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(41, 41, 'Murl Mayert', '0586600745', 'Huế', 'Quận 5', 'Phường Bến Nghé', '1338 Raynor Locks Apt. 460', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(42, 42, 'Adelia Kohler', '0094673697', 'Huế', 'Quận 3', 'Phường Bến Nghé', '9950 Jorge Wall', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(43, 43, 'Frieda Lindgren', '0537084159', 'Cần Thơ', 'Quận 5', 'Phường Tân Định', '326 Jacobs Prairie', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(44, 44, 'Berta Baumbach', '0757990036', 'Huế', 'Quận 3', 'Phường An Phú', '32754 Reina Neck Suite 606', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(45, 45, 'Maeve Heathcote', '0610605577', 'Hồ Chí Minh', 'Quận 7', 'Phường Thảo Điền', '940 Bartoletti Mall Suite 439', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(46, 46, 'Mohammad Stanton', '0398131691', 'Đà Nẵng', 'Quận 7', 'Phường Cầu Kho', '24798 Lilla Camp', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(47, 47, 'Justyn Ondricka', '0599426704', 'Huế', 'Quận 1', 'Phường Tân Định', '4756 Cathryn Walk', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(48, 48, 'June Dooley', '0714132684', 'Hồ Chí Minh', 'Quận 1', 'Phường Cầu Kho', '595 Gusikowski Forges', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(49, 49, 'Lucy Armstrong', '0833902096', 'Đà Nẵng', 'Quận 3', 'Phường Thảo Điền', '85700 Leone Springs', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(50, 50, 'Hunter Mertz', '0433535701', 'Hồ Chí Minh', 'Quận 1', 'Phường Thảo Điền', '452 Morissette Valley Apt. 577', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `otp_verifies`
--

CREATE TABLE `otp_verifies` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `otp_code` varchar(255) NOT NULL,
  `expired` int(11) NOT NULL,
  `type` varchar(255) NOT NULL,
  `is_verify` tinyint(1) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `token` varchar(64) NOT NULL,
  `abilities` text DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `policies`
--

CREATE TABLE `policies` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `policy_name` varchar(255) NOT NULL,
  `policy_content` text NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `products`
--

CREATE TABLE `products` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_name` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `price` decimal(10,2) NOT NULL,
  `discount_price` decimal(10,2) NOT NULL DEFAULT 0.00,
  `stock` int(10) UNSIGNED NOT NULL,
  `product_image` varchar(255) NOT NULL,
  `catalog_id` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `products`
--

INSERT INTO `products` (`id`, `product_name`, `description`, `price`, `discount_price`, `stock`, `product_image`, `catalog_id`, `created_at`, `updated_at`) VALUES
(1, 'Tổng Đài Kể Chuyện Lúc 0h', '“Chào mừng đến với Tổng đài kể chuyện lúc 0 giờ. Đêm nay, chúng ta sẽ đến với một câu chuyện mới…”\n\nCứ mỗi đêm, cô bé mồ côi câm điếc tên Thanh lại “nghe” thấy tiếng chuông quỷ dị phát ra từ chiếc điện thoại đồ chơi cũ ở cô nhi viện mà cô vừa chuyển đến...\n\nTại sao Thanh có thể “nghe” được âm thanh từ một chiếc điện thoại đồ chơi? Điều gì đang thực sự diễn ra ở cô nhi viện và liệu nó có liên quan đến sự tồn tại kỳ lạ của chiếc điện thoại ấy hay không?', 70000.00, 10.00, 9, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352079/lo8vgjtcahahdsjrgrtx.webp', 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(2, 'Sĩ Số Lớp Vắng 0', '“Tiếng gọi bí ẩn trong căn phòng đó dường như chỉ có mình tôi nghe thấy...”\n\nSau khi bóng đêm nuốt trọn ngôi trường, những điều quỷ dị đã xảy ra... Cuốn sách bao gồm 10 câu chuyện kinh dị, ám ảnh về những hồn ma, sự kiện rùng rợn trong trường học. Sách được chắp bút bởi Emma Hạ My, chủ sở hữu kênh Youtube “Truyện của Emma”.', 80000.00, 8.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745351939/bxvwpe5m9o56m3ayqpju.webp', 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(3, 'Người Chết Biết Điều Gì', 'Đằng sau cánh cửa im lìm là một cái xác đang phân hủy, thối rữa và bốc mùi ngai ngái. Những vết cắn nham nhở của lũ chuột ngập ngụa trên đống nội tạng bầy nhầy. Cẳng tay, cẳng chân được đựng trong túi du lịch và vết xăm mình là dấu hiệu duy nhất để nhận dạng danh tính, nhưng... chúng không thuộc về cùng một người.', 95000.00, 12.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352790/bnoitqyj2dkdr5hlfenz.webp', 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(4, 'Hồ Điệp Và Kình Ngư', 'Một câu chuyện cuốn hút ngay từ những trang đầu tiên - Khi tình yêu trở thành sợi dây mong manh giữa sinh tử, phản bội và hy vọng. Khi một nàng hồ điệp nhỏ bé chạm trán với kình ngư mạnh mẽ, liệu đó là định mệnh hay chỉ là một giấc mộng chóng tàn?', 60000.00, 10.00, 20, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352779/ahx6tjkgdacl64uoklab.webp', 6, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(5, 'Món Quà Đến Từ Cõi Chết', '10 người bạn thân đột nhiên nhận được tin nhắn từ kẻ nặc danh, mời họ tham gia trò chơi tử thần với số tiền thưởng hấp dẫn. Liệu họ có thể vượt qua thử thách đầy nguy hiểm này hay không? Bí ẩn và linh hồn sẽ được tiết lộ qua các mã Morse thần bí.', 85000.00, 12.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352784/nq7cqzimjte1vmkqcwbg.webp', 1, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(6, '100 Truyện Ngụ Ngôn Song Ngữ Anh - Việt Hay Nhất', 'Cuốn sách này tổng hợp 100 truyện ngụ ngôn đặc sắc nhất của nhiều quốc gia trên thế giới.\n\nMỗi truyện lại mang đến những bài học đáng quý khác nhau, nhờ đó mà trẻ có thể học được nhiều điều hay, lẽ phải, tu dưỡng ý chí phấn đấu, tự hoàn thiện bản thân.\n\nKhông chỉ vậy, cuốn sách được viết dưới dạng song ngữ Anh - Việt sẽ giúp trẻ nâng cao vốn từ vựng, học cách sử dụng đúng ngữ pháp và trở nên thích thú với Tiếng Anh.', 60000.00, 15.00, 8, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352760/xklpwnyyimegqol6nmku.webp', 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(7, 'Chuyện Con Mèo Dạy Hải Âu Bay (Tái Bản 2024)', 'Câu chuyện về chú mèo Zorba và cô hải âu Kengah đã truyền tải thông điệp ý nghĩa về sự sẻ chia và yêu thương, cũng như tinh thần trách nhiệm với môi trường sống. Tác phẩm là một kiệt tác thiếu nhi của nhà văn Luis Sepúlveda.', 70000.00, 10.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352770/bshfq4xx7o8vyzzf6u8c.webp', 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(8, 'Danh Nhân Thế Giới - Einstein (Tái Bản 2022)', 'Cuốn sách kể về cuộc đời và sự nghiệp của nhà vật lý thiên tài Einstein, người đã để lại di sản vĩ đại cho nhân loại với Thuyết tương đối và nhiều đóng góp khoa học khác.', 75000.00, 4.00, 9, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352772/h3lpb1z8qrngtx96l3et.webp', 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(9, 'Hoàng Tử Bé (Tái Bản 2022)', 'Hoàng Tử Bé là một tác phẩm thiếu nhi kinh điển, chứa đựng những triết lý sâu sắc về tình bạn, tình yêu và ý nghĩa của cuộc sống. Tác phẩm này đã làm say đắm bao thế hệ độc giả trên toàn thế giới.', 85000.00, 4.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352778/asxt9us6jspby8pdolon.webp', 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(10, '1000 Câu Đố Phát Triển Trí Tuệ - Thách Thức IQ (Tái Bản 2019)', 'Cuốn sách chứa đựng 1000 câu đố logic và thử thách trí tuệ, giúp trẻ rèn luyện tư duy và phát triển IQ một cách toàn diện.', 65000.00, 10.00, 8, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352760/wxwptabtb3tkupimvs55.webp', 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(11, '100 Kỹ Năng Sinh Tồn', 'Cuốn sách phác thảo chi tiết nhiều chiến lược và kỹ năng sinh tồn trong các tình huống nguy hiểm, giúp bạn bảo vệ bản thân và người thân yêu.', 80000.00, 8.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352759/rdqms5jnr16r7xpncrgu.webp', 2, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(12, 'Trốn Lên Mái Nhà Để Khóc', 'Những cơn gió heo may len lỏi vào từng góc phố nhỏ, mùa thu về gợi nhớ bao yêu thương đong đầy... Cuốn sách là những tản văn về mẹ, về bà, về gia đình và ký ức tuổi thơ đầy lắng đọng, nơi bạn có thể tìm lại mình sau những lo toan cuộc sống.', 70000.00, 7.00, 9, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352794/bfoorledwskrplncoisu.webp', 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(13, 'Qua Lăng Kính Của Một Chú Mèo', 'Cuốn sách mượn lời một chú mèo để truyền tải thông điệp về hạnh phúc. Không cần phải thành công vượt bậc hay giàu có mới có hạnh phúc, mà chỉ đơn giản là biết tận hưởng từng giây phút hiện tại.', 80000.00, 9.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352792/yhq9vptxhh32at57jzku.webp', 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(14, 'Một Cuốn Sách Tích Cực', 'Cuốn sách chứa đựng 117 thông điệp tích cực giúp bạn tìm ra câu trả lời trong cuộc sống, vượt qua nỗi buồn để trân trọng niềm vui và hướng tới một tương lai tươi sáng.', 60000.00, 5.00, 8, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352785/qqxoxn8bswpqmbdwh7ys.webp', 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(15, 'Về Nhà Ăn Bát Cháo Hành', 'Cuốn sách ghi lại những mẩu chuyện xúc động về gia đình, nơi tình thương luôn hiện hữu. Đọc để thêm trân quý những khoảnh khắc sum vầy bên mâm cơm gia đình và yêu thương những người thân của mình.', 75000.00, 10.00, 9, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352797/zn6xa8wqp5zwamj4dest.webp', 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(16, 'Cất Cho Tôi Những Ngày Xanh Nắng Hạ', 'Tập truyện gồm 15 truyện ngắn về tuổi trẻ, những sai lầm, vấp ngã và sự trưởng thành. Dành cho những ai muốn tìm lại mình sau những ngày nắng hạ cháy rực của tuổi thanh xuân.', 70000.00, 10.00, 9, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352768/bjhkxt8apf7dkly2syog.webp', 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(17, 'Chúng Ta Có Hẹn Với Bình Yên', 'Cuốn sách là hành trình tìm kiếm bình yên sau những mối tình tan vỡ, những tổn thương, và những năm tháng thanh xuân nhiều khắc khoải. Nhẹ nhàng, sâu lắng nhưng đầy hi vọng về một tương lai bình yên.', 65000.00, 10.00, 8, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352769/wfran1w1esleezmc1492.webp', 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(18, 'Mẹ Làm Gì Có Ước Mơ', 'Cuốn sách chứa đựng những hoài niệm về tình yêu thương vô điều kiện của mẹ dành cho con. Những hy sinh thầm lặng mà mẹ dành cho con là điều quý giá nhất, đáng được trân trọng và yêu thương.', 85000.00, 10.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352784/epppsmeymq41e0pb6kp3.webp', 3, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(19, 'Sự Im Lặng Của Bầy Cừu (Tái Bản 2019)', 'Một câu chuyện kinh điển của thể loại trinh thám và kinh dị, kể về hành trình điều tra của Clarice Starling - một thực tập sinh của FBI - khi cô tìm đến sự trợ giúp của bác sĩ tâm lý Hannibal Lecter, người vừa là kẻ giết người hàng loạt vừa là thiên tài. Cuốn sách đưa người đọc vào một hành trình hồi hộp đến nghẹt thở, nơi các bí ẩn và tội ác đen tối dần dần được phơi bày.', 90000.00, 10.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352794/x5ltqe25auwsp0nvpm0x.webp', 4, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(20, 'Cuộc Viếng Thăm Của Vị Khách Bí Ẩn', 'R. Austin Freeman mang đến một câu chuyện trinh thám tuyệt vời với nhân vật chính là bác sĩ pháp y Thorndyke. Khi một người đàn ông giàu có qua đời trong những hoàn cảnh bí ẩn, Thorndyke được mời đến để điều tra và phát hiện ra nhiều điều kỳ lạ hơn tưởng tượng. Cuốn sách chứa đầy các chi tiết về pháp y, là một tác phẩm lý thú cho những ai yêu thích thể loại này.', 75000.00, 10.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352771/ef6lrtsh2tcquxqsb0xd.webp', 4, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(21, 'Ghi Chép Pháp Y - Những Cái Chết Bí Ẩn', 'Cuốn sách ghi lại những câu chuyện kỳ bí và kinh dị mà một bác sĩ pháp y đã trải qua trong sự nghiệp của mình. Từ các vụ án mạng tàn khốc đến các vụ tử vong kỳ lạ, cuốn sách cung cấp một góc nhìn chân thực về công việc của pháp y và những bí mật của cái chết.', 80000.00, 10.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352791/ngggfklrqvue7eqpeovp.webp', 4, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(22, 'Ghi Chép Pháp Y - Tập 2 - Khi Tử Thi Biết Nói', 'Tiếp nối thành công của tập 1, tập 2 của \'Ghi Chép Pháp Y\' đào sâu vào các vụ án phức tạp hơn, nơi các bằng chứng từ thi thể là chìa khóa để giải mã các bí ẩn. Cuốn sách là một hành trình đáng sợ nhưng cuốn hút qua con mắt của một bác sĩ pháp y, đưa người đọc đến gần hơn với những sự thật đằng sau mỗi cái chết.', 85000.00, 10.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352782/nq1pl6c3mfbtmzkloisj.webp', 4, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(23, 'Nạn Nhân Số 13', 'Một cuộc chiến căng thẳng giữa một luật sư tài ba và một kẻ giết người hàng loạt. Eddie Flynn, với khả năng tài tình trong việc nắm bắt tâm lý đối thủ, phải sử dụng mọi kỹ năng của mình để cứu một người vô tội và lật tẩy những bí mật đằng sau vụ án kinh hoàng. \'Nạn Nhân Số 13\' là một cuốn sách không thể bỏ qua với những ai yêu thích trinh thám và pháp lý.', 95000.00, 10.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352786/fajmtw4vglu1ilvyxnyd.webp', 4, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(24, 'Truyện Cười Việt Nam Thời @', 'Cuốn sách \'Truyện Cười Việt Nam Thời @\' của Nguyễn Cừ là một tuyển tập hài hước về đời sống xã hội hiện đại. Tác giả khai thác các tình huống hài hước đặc trưng của thời đại công nghệ với sự phát triển của mạng xã hội, các thiết bị công nghệ cao và cả những thói quen mới hình thành trong xã hội. Những câu chuyện ngắn gọn, sinh động và đậm chất hài hước của người Việt sẽ giúp người đọc giải trí và có những phút giây thư giãn.', 50000.00, 10.00, 6, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352795/vntcxrgxhyhddshywjym.webp', 5, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(25, 'Cây Cam Ngọt Của Tôi', 'Câu chuyện cảm động về cậu bé Zezé, một đứa trẻ 5 tuổi sống trong một gia đình nghèo khó ở Brazil. Cuộc sống của Zezé dường như tăm tối bởi sự nghèo khó, thiếu thốn và cả những trận đòn roi. Nhưng cậu tìm được niềm vui từ người bạn đặc biệt là một cây cam ngọt, và từ đó cuộc đời của cậu đã trở nên tươi sáng hơn. Tác phẩm là một bức tranh sâu sắc về sự cô đơn, nỗi buồn, nhưng cũng đầy tình yêu thương, lòng trắc ẩn, và hy vọng.', 65000.00, 10.00, 8, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352768/ghwcuahxxb3zvom38aaz.webp', 6, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(26, 'Ngày Xưa Có Một Chuyện Tình', 'Nguyễn Nhật Ánh đưa độc giả trở về với những năm tháng tuổi thơ đầy yêu thương và ngọt ngào qua cuốn tiểu thuyết \'Ngày Xưa Có Một Chuyện Tình\'. Cuốn sách kể về mối tình trong sáng nhưng cũng đầy trăn trở của ba người bạn thân, với nhiều cung bậc cảm xúc và những giây phút suy tư về tình yêu, tình bạn và những thay đổi khi trưởng thành. Đây là tác phẩm thấm đẫm tình cảm, nhẹ nhàng nhưng sâu sắc, khiến người đọc không khỏi bồi hồi và xúc động.', 70000.00, 10.00, 9, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352787/uw6voxt5f5leaee8wd20.webp', 6, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(27, 'Mắt Biếc (Tái Bản 2022)', 'Tác phẩm nổi tiếng của Nguyễn Nhật Ánh kể về chuyện tình đẹp nhưng buồn của Ngạn và Hà Lan. Từ thuở nhỏ đến khi trưởng thành, tình yêu Ngạn dành cho Hà Lan vẫn không thay đổi, nhưng trái tim Hà Lan lại hướng về thành phố và những mộng mơ khác. \'Mắt Biếc\' là một câu chuyện cảm động, đậm chất lãng mạn, buồn bã, về tình yêu đơn phương và sự hy sinh, được tái bản năm 2022 cùng với nhiều hình ảnh minh họa mới.', 75000.00, 10.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352782/vmwm0ibp5oxkq8cgh9yn.webp', 6, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(28, 'Di Sản Hồ Chí Minh - Hành Trình Theo Chân Bác (Tái Bản 2021)', 'Cuốn sách \'Di Sản Hồ Chí Minh - Hành Trình Theo Chân Bác\' của Trần Đức Tuấn là một hành trình đưa người đọc trở lại với những cống hiến và di sản lớn lao của Chủ tịch Hồ Chí Minh để lại cho dân tộc Việt Nam. Cuốn sách khai thác những câu chuyện, những chặng đường gian khó mà Bác đã đi qua để đấu tranh vì độc lập, tự do, đồng thời thể hiện sâu sắc tư tưởng nhân văn, tình yêu nước, thương dân của Người.', 90000.00, 10.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352778/gsqfghxzlias6gv7hgpi.webp', 7, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(29, 'Người Lính Điện Biên Kể Chuyện (Tái Bản 2022)', 'Cuốn sách \'Người Lính Điện Biên Kể Chuyện\' là một tác phẩm ghi lại những câu chuyện xúc động từ chính những người lính đã tham gia chiến dịch Điện Biên Phủ lừng lẫy. Qua từng câu chuyện, Đỗ Ca Sơn và Kiều Mai Sơn giúp người đọc hiểu thêm về sự quả cảm, tinh thần yêu nước và những hi sinh thầm lặng của những người lính trong cuộc kháng chiến vì độc lập dân tộc. Cuốn sách tái bản năm 2022 với nhiều bổ sung và chỉnh sửa, mang đến cho độc giả cái nhìn sâu sắc hơn về thời kỳ hào hùng trong lịch sử Việt Nam.', 80000.00, 10.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352790/lkzrdwdmugkpn8icwxls.webp', 7, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(30, 'Việt Nam Phong Tục (Tái Bản 2023)', 'Cuốn sách \'Việt Nam Phong Tục\' của Phan Kế Bính là một trong những tác phẩm nghiên cứu đầu tiên và toàn diện về các phong tục, tập quán của người Việt. Tác phẩm mô tả chi tiết cuộc sống, cách thức sinh hoạt, lễ nghi, tín ngưỡng của người Việt qua từng vùng miền và từng giai đoạn lịch sử. Tái bản năm 2023, cuốn sách này tiếp tục là tài liệu quý giá cho những ai muốn tìm hiểu sâu hơn về văn hóa và bản sắc Việt Nam.', 85000.00, 10.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745362496/oqbg9etcaxo5c4ygsjhu.webp', 8, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(31, 'Nghĩ Giàu & Làm Giàu (Tái Bản 2020)', 'Là cuốn sách kinh điển của Napoleon Hill, \'Nghĩ Giàu & Làm Giàu\' chia sẻ những nguyên tắc thành công và tư duy làm giàu mà ông đã nghiên cứu qua nhiều năm. Dựa trên cuộc phỏng vấn với hàng trăm người thành công, Napoleon Hill đúc kết ra những bí quyết và nguyên lý về tư duy và hành động để đạt được sự giàu có và hạnh phúc. Cuốn sách tái bản năm 2020 và vẫn là nguồn cảm hứng cho nhiều thế hệ độc giả.', 70000.00, 10.00, 9, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352788/gwnml3fiskj2tnabl2nd.webp', 9, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(32, 'Nghệ Thuật Lãnh Đạo - Chân Dung Những CEO, Nhà Sáng Lập Và Những Người Thay Đổi Cuộc Chơi Vĩ Đại Nhất Thế Giới', 'David M Rubenstein, một trong những nhà đầu tư và từ thiện hàng đầu nước Mỹ, chia sẻ những cuộc phỏng vấn sâu sắc với các CEO, nhà sáng lập, và những người đã thay đổi thế giới. \'Nghệ Thuật Lãnh Đạo\' mang đến cho độc giả các câu chuyện về tầm nhìn, lòng kiên định và các quyết định quan trọng của những người đã để lại dấu ấn to lớn trong lĩnh vực của họ. Đây là tác phẩm không thể bỏ qua cho những ai quan tâm đến nghệ thuật lãnh đạo và phát triển sự nghiệp.', 90000.00, 10.00, 10, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352788/z60vclvzcwdgr4chmrtv.jpg', 9, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(33, 'Bút Bi Bấm 0.7 mm - M&G ABP04833A04833 - Mực Xanh', 'Là dòng sản phẩm rất tiện lợi cho các bạn khối văn phòng, giáo viên.\n\nThân bút bằng nhựa trong suốt kết hợp với cài chắc khỏe hiện đại.\n\nBút được sản xuất theo dây truyền công nghệ mực in nên mực viết rất êm mượt không thấm nhòe khi gặp nước.\n\nLò xo được sản xuất theo thép đàn hồi cho áp lực viết rất thoải mái…', 5000.00, 10.00, 69, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352763/jyjxclr2jn5sm64ehjzh.jpg', 10, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(34, 'Bút Lông Bảng 2.5 mm - Faber-Castell 552951 - Màu Xanh Dương', 'Bút được sản xuất theo công nghệ hiện đại , đạt tiêu chuẩn an toàn quốc tế. Bạn sẽ an tâm hơn về chất lượng cũng như cụ thể hóa hơn nhiều cho từng nhu cầu sử dụng trong việc học, văn phòng, trang trí, thiết kế....\n\nMực đậm, lượng mực cực kỳ nhiều, thêm mực dễ dàng sau khi viết hết. Dễ viết dễ xóa. Ngòi viết ra mực đều màu, êm, khi xóa không làm xước bề mặt bảng.\n\nMực dạng hạt phân tán, có nhiều màu và có mùi thơm dễ chịu. Sản phẩm hoàn toàn không chứa Xylene hay các chất gây nguy hiểm đến sức khỏe.', 15000.00, 10.00, 25, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352765/zvndubpgoqq8fkswcqhj.webp', 10, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(35, 'Bút Vẽ Kỹ Thuật 0.2 mm - Artline EK-220-RD - Màu Đỏ', 'Bút có ngòi siêu nhỏ chỉ 0.2 mm dùng để vẽ hoặc đi nét chi tiết cực kì nhỏ trong vẽ chân dung, ký họa, anime, chibi,…\n\nThân bút cứng chắc, cầm cực nhẹ tay với độ chính xác cao. Chúng ta quan sát nét bút dễ dàng và điều khiển ngòi bút thoải mái nhất.\n\nĐặc biệt, ngòi bút bằng sợi Polyester cao cấp giúp mực luôn thấm đều, nét bút mềm mại.\n\nBút sử dụng dòng mực pigment cao cấp kháng nước tuyệt đối đảm bảo không bị lem nhòe khi thấm nước giúp bảo quản được sản phẩm lâu dài trước tác động của bên ngoài.\n\nBút được dùng phổ biến ở trong giới kiến trúc sư, sinh viên kiến trúc, mỹ thuật, những người yêu vẽ,…', 24000.00, 10.00, 53, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352767/wg35gnzt1u6cpuoqtowx.webp', 10, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(36, 'Bút Chì Gỗ 2B Có Gôm Soft Series - Smart Kids SK-PC2B011', 'Bút chì gỗ 2B SK-PC2B011 thích hợp cho các hoạt động như ghi chép, vẽ nháp, học tập.\n\nNét đậm, để lại nhiều than chì trên giấy\n\nLướt rất nhẹ nhàng trên bề mặt viết\n\nDùng để đánh bóng các bức vẽ, đạt đến nhiều mức độ sáng tối khác nhau. Ngoài ra khá hữu dụng trong việc tô đậm vào ô trả lời trắc nghiệm nhanh nhất.\n\nThân lục giác, độ đậm 2B.', 4000.00, 10.00, 34, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352763/o7e6yb6loxzvfqfqesa6.webp', 10, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(37, 'Bút Lông Bảng 2.0 mm - Artline EK-517-BK - Màu Đen', 'Bút chuyên sử dụng trong giảng đường hoặc hội trường lớn. Bạn sẽ an tâm hơn về chất lượng cũng như cụ thể hóa hơn nhiều cho từng nhu cầu sử dụng trong việc học, văn phòng, trang trí, thiết kế....\n\nMực đậm, lượng mực cực kỳ nhiều, thêm mực dễ dàng sau khi viết hết. Dễ viết dễ xóa. Ngòi viết ra mực đều màu, êm, khi xóa không làm xước bề mặt bảng.\n\nMực dạng hạt phân tán, có nhiều màu và có mùi thơm dễ chịu. Sản phẩm hoàn toàn không chứa Xylene hay các chất gây nguy hiểm đến sức khỏe.', 37000.00, 10.00, 46, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352766/hdutmbse6do91tsi8z0e.webp', 10, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(38, 'Bút Gel Softline 0.7 mm - Artline EGB-1700-BK - Màu Đen', 'Sản phẩm là dòng bút gel có mực đặc biệt, nó không gắt và sệt như dòng mực của bút gel thông thường.\n\nBút được chế tạo dựa trên một nguyên lý khác, mực có gốc nước (không phải gốc dầu) nên có màu sắc rất đẹp và sặc sở.\n\nBút Artline 1700 có nét bút cực kỳ mềm mại, đều và hoàn toàn không bị tắt mực trong quá trình sử dụng. Hơn nữa mực của bút Gel Artline thuộc dòng mực an toàn nên có thể thoải mái sử dụng mà không lo ngại đến sức khỏe và môi trường.\n\nBút chuyên dùng để viết, vẽ và trang trí lên các bưu thiếp, thiệp cưới có màu sáng và các thiệp mời khác. Bút sẽ đẹp hơn nếu viết trên giấy mỹ thuật trắng hoặc ngà.', 38000.00, 10.00, 24, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352765/jasiohkm5ygbmfprmn95.webp', 10, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(39, 'Bút Bi 0.6 mm - Stacom BP2026-A - Mực Đen', '', 4000.00, 10.00, 56, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352761/almtl7tifb5jkbzl1h6c.webp', 10, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(40, 'Bút Dạ Quang Boss Mini - Stabilo HL07-24 - Màu Vàng', 'Bút có thể bơm mực giúp tiết kiệm chi phí, mực dạng nước dùng cho giấy thường, giấy photo... đặc biệt không để lại dấu vết khi muốn photo, fax vô cùng tiện lợi.\n\nSử dụng bởi các nguyên liệu tốt cho môi trường. Mực không chứa độc tố nên rất an toàn cho sức khỏe người tiêu dùng.\n\nVới kích thuớc nhỏ gọn, bạn có thể dễ dàng cất giữ bút trong ba lô và mang theo khi đi học, đi làm. Bạn sẽ hoàn toàn yên tâm với chất lượng của bút Dạ Quang Stabilo Boss Mini HL07.\n\nSở hữu thiết kế thông minh, bút cầm khá chắc tay và dễ sử dụng giúp đánh dấu những phần quan trọng, cho bạn ghi nhớ dễ dàng.\n\nBút vừa có thể trang trí, đánh dấu và có khả năng phát quang nên giúp ích rất nhiều cho bạn.', 43500.00, 10.00, 31, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352764/jwsc1ub9zylurliot2lc.webp', 10, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(41, 'Bấm Kim Mini Kèm Ghim Bấm Công Chúa Elsa - Ume A74012-F1X', 'Là bộ sản phẩm cần thiết cho học sinh, sinh viên và dân văn phòng để đóng hồ sơ, giấy tờ thành tập gọn gàng, ngăn nắp.\n\nBấm kim với lực bấm nhẹ, có khả năng bấm nhanh và chuẩn xác, không làm bung kim hoặc rách giấy.\n\nKim bấm có kích thước nhỏ, chất liệu thép cao cấp, độ cứng và độ bền cao.', 45000.00, 10.00, 11, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352760/kec1amkdztj52orwlszd.webp', 11, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(42, 'Hộp Tiết Kiệm Squid Game Có Khóa - Main Paper NFJC015-01', 'Squid Game là một bộ phim truyền hình Hàn Quốc được sản xuất bởi Netflix, xoay quanh một trò chơi sinh tồn đầy kịch tính, nơi những người tham gia phải đối mặt với những thử thách nguy hiểm để giành lấy giải thưởng khổng lồ. Bộ phim đã trở thành một hiện tượng toàn cầu, thu hút hàng triệu khán giả với cốt truyện kịch tính, hình ảnh đậm chất nghệ thuật và những thông điệp sâu sắc về xã hội.\n\nBạn có thể sử dụng hộp tiết kiệm mini này như một chú heo đất tiết kiệm.\n\nGiúp bạn quản lý và tiết kiệm tiền hiệu quả mà an toàn!\n\nVới quà tặng Ống Tiền Tiết Kiệm các bậc phụ huynh có thể tạo lập cho con em mình không tiêu xài phung phí lại tiếp cận được công nghệ hiện đại...', 205000.00, 10.00, 3, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352781/fz1njozahwwfwkwijcfq.webp', 11, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(43, 'Túi Zip Đựng Tài Liệu Hangyodon A4 - GuangBo KT83104 - Mẫu 1', 'Túi dây kéo khoá được làm bằng nhựa trong có khoá kéo được làm bằng nhựa với thiết kế đơn giản cho độ bền chắc cao dùng để lưu giữ bảo quản hồ sơ, tài liệu.\n\nSản phẩm dễ sử dụng đặc biệt khoá kéo trơn ít bị kẹt khoá.\n\nThật tiện lợi với khổ A4 có khoá dây kéo bên ngoài.', 40000.00, 10.00, 43, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352795/pln14tff2khembqzb2sf.webp', 11, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(44, 'Hộp Bút Nhựa Capybara - Phú Vinh Phát - Great', 'Hộp Bút Nhựa Capybara - Phú Vinh Phát được làm từ chất liệu đẹp, dày chắc, dễ dàng vệ sinh, thuận tiện cho việc sử dụng và bảo quản.\n\nKiểu dáng hộp bút chữ nhật gọn nhẹ, đặc biệt hộp có thể đứng vững trên các mặt phẳng.\n\nDây khóa kéo chắc chắn, trơn tru giúp bạn đóng / mở dễ dàng, thuận tiện khi sử dụng.\n\nThiết kế ngăn đựng rộng rãi, đựng được nhiều loại dụng cụ học tập, văn phòng phẩm như =>  bút viết, thước kẻ, compa...\n\nVới chiếc hộp đựng bút này, bạn có thể tùy ý sắp xếp vật dụng cá nhân của mình một cách gọn gàng, ngăn nắp và còn có thể mang theo bên người để sử dụng vào bất kỳ lúc nào.', 78000.00, 10.00, 22, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352780/n34ovtpjftngt6acbw96.jpg', 11, '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(45, 'Băng Keo Giấy 2F5 - Hiệp Phát - Màu Kem', 'Sản phẩm có khả năng bám dính tốt, dẻo dai, không chứa các hóa chất độc hại, an toàn cho sức khỏe người sử dụng.\n\nBề mặt băng dính mịn, đảm bảo tính thẩm mỹ khi dán lên các đồ dùng.\n\nSản phẩm có thể viết lên được, tiện lợi cho bạn trong quá trình sử dụng.\n\nSản phẩm không để lại vết keo dính trên bề mặt, dễ dàng xé được bằng tay, có thể dùng để dán các hộp giấy đựng đồ vật hay được sử dụng cho nhiều mục đích khác nhau.\n\nSản phẩm được sử dụng rộng rãi trong cuộc sống, từ trường học, văn phòng, gia đình đến các cơ sở sản xuất thủ công...', 13000.00, 10.00, 95, 'https://res.cloudinary.com/whr-clound/image/upload/v1745352761/zq7l7bhy1o6xruk5qfuu.webp', 11, '2025-05-15 05:49:58', '2025-05-15 05:49:58');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `product_attributes`
--

CREATE TABLE `product_attributes` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED DEFAULT NULL,
  `attr_name` varchar(255) NOT NULL,
  `attr_value` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `product_attributes`
--

INSERT INTO `product_attributes` (`id`, `product_id`, `attr_name`, `attr_value`, `created_at`, `updated_at`) VALUES
(1, 1, 'Trọng lượng (gr)', '350', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(2, 1, 'Kích Thước Bao Bì', '20.5 x 14 x 1.6 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(3, 1, 'Số trang', '332', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(4, 1, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(5, 2, 'Trọng lượng (gr)', '280', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(6, 2, 'Kích Thước Bao Bì', '20.5 x 13 x 1.3 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(7, 2, 'Số trang', '264', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(8, 2, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(9, 3, 'Trọng lượng (gr)', '520', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(10, 3, 'Kích Thước Bao Bì', '15.5 x 23.5 x 2.5', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(11, 3, 'Số trang', '516', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(12, 3, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(13, 5, 'Trọng lượng (gr)', '430', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(14, 5, 'Kích Thước Bao Bì', '24 x 16 x 2 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(15, 5, 'Số trang', '412', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(16, 5, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(17, 6, 'Trọng lượng (gr)', '450', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(18, 6, 'Kích Thước Bao Bì', '26 x 19 x 1.2 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(19, 6, 'Số trang', '207', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(20, 6, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(21, 7, 'Người Dịch', 'Phương Huyền', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(22, 7, 'Trọng lượng (gr)', '300', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(23, 7, 'Kích Thước Bao Bì', '20.5 x 14 x 0.7 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(24, 7, 'Số trang', '142', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(25, 7, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(26, 8, 'Người Dịch', 'Nguyễn Kim Dung', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(27, 8, 'Trọng lượng (gr)', '200', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(28, 8, 'Kích Thước Bao Bì', '20.5 x 14.5 x 0.8 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(29, 8, 'Số trang', '159', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(30, 8, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(31, 9, 'Người Dịch', 'Nguyễn Thành Long', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(32, 9, 'Trọng lượng (gr)', '120', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(33, 9, 'Kích Thước Bao Bì', '19 x 13 x 0.7 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(34, 9, 'Số trang', '112', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(35, 9, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(36, 10, 'Người Dịch', 'Thùy An', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(37, 10, 'Trọng lượng (gr)', '220', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(38, 10, 'Kích Thước Bao Bì', '14.5 x 20.5', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(39, 10, 'Số trang', '208', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(40, 10, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(41, 11, 'Người Dịch', 'Mai Loan', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(42, 11, 'Trọng lượng (gr)', '300', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(43, 11, 'Kích Thước Bao Bì', '24 x 16 x 0.5 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(44, 11, 'Số trang', '272', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(45, 11, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(46, 12, 'Trọng lượng (gr)', '220', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(47, 12, 'Kích Thước Bao Bì', '20 x 12 x 1 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(48, 12, 'Số trang', '208', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(49, 12, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(50, 13, 'Người Dịch', 'Lexi_mineme', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(51, 13, 'Trọng lượng (gr)', '190', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(52, 13, 'Kích Thước Bao Bì', '19.5 x 13.5 x 0.8 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(53, 13, 'Số trang', '176', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(54, 13, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(55, 14, 'Người Dịch', 'Thùy Vân', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(56, 14, 'Trọng lượng (gr)', '250', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(57, 14, 'Kích Thước Bao Bì', '19 x 13 x 1 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(58, 14, 'Số trang', '216', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(59, 14, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(60, 15, 'Trọng lượng (gr)', '220', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(61, 15, 'Kích Thước Bao Bì', '20.5 x 13 x 1 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(62, 15, 'Số trang', '208', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(63, 15, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(64, 16, 'Trọng lượng (gr)', '230', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(65, 16, 'Kích Thước Bao Bì', '20.5 x 13 x 1 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(66, 16, 'Số trang', '212', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(67, 16, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(68, 17, 'Trọng lượng (gr)', '250', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(69, 17, 'Kích Thước Bao Bì', '20.5 x 13 x 1 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(70, 17, 'Số trang', '200', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(71, 17, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(72, 18, 'Trọng lượng (gr)', '190', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(73, 18, 'Kích Thước Bao Bì', '20.5 x 13 cm x 1.5', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(74, 18, 'Số trang', '208', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(75, 18, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(76, 19, 'Người Dịch', 'Phạm Hồng Anh', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(77, 19, 'Trọng lượng (gr)', '360', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(78, 19, 'Kích Thước Bao Bì', '15 x 24', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(79, 19, 'Số trang', '359', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(80, 19, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(81, 20, 'Người Dịch', 'Trân', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(82, 20, 'Trọng lượng (gr)', '240', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(83, 20, 'Kích Thước Bao Bì', '20.5 x 14.5 x 1.1 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(84, 20, 'Số trang', '224', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(85, 20, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(86, 21, 'Người Dịch', 'Bùi Thanh Thúy', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(87, 21, 'Trọng lượng (gr)', '350', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(88, 21, 'Kích Thước Bao Bì', '24 x 15.7 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(89, 21, 'Số trang', '344', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(90, 21, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(91, 22, 'Người Dịch', 'Linh Tử', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(92, 22, 'Trọng lượng (gr)', '250', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(93, 22, 'Kích Thước Bao Bì', '24 x 15.7 x 1.1 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(94, 22, 'Số trang', '232', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(95, 22, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(96, 23, 'Người Dịch', 'Thảo Nguyên', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(97, 23, 'Trọng lượng (gr)', '480', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(98, 23, 'Kích Thước Bao Bì', '24 x 16 x 2.3 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(99, 23, 'Số trang', '464', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(100, 23, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(101, 24, 'Trọng lượng (gr)', '325', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(102, 24, 'Kích Thước Bao Bì', '20.5 x 14.5 x 1.5 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(103, 24, 'Số trang', '376', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(104, 24, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(105, 25, 'Người Dịch', 'Nguyễn Bích Lan, Tô Yến Ly', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(106, 25, 'Trọng lượng (gr)', '280', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(107, 25, 'Kích Thước Bao Bì', '20 x 14.5 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(108, 25, 'Số trang', '244', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(109, 25, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(110, 26, 'Trọng lượng (gr)', '200', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(111, 26, 'Kích Thước Bao Bì', '14.5 x 10 x 1.4 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(112, 26, 'Số trang', '296', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(113, 26, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(114, 27, 'Trọng lượng (gr)', '230', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(115, 27, 'Kích Thước Bao Bì', '14.5 x 10 x 0.5 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(116, 27, 'Số trang', '244', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(117, 27, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(118, 28, 'Trọng lượng (gr)', '343', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(119, 28, 'Kích Thước Bao Bì', '20.5 x 13 x 1.5 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(120, 28, 'Số trang', '351', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(121, 28, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(122, 29, 'Trọng lượng (gr)', '132', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(123, 29, 'Kích Thước Bao Bì', '20.5 x 14.5 x 0.5 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(124, 29, 'Số trang', '102', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(125, 29, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(126, 30, 'Trọng lượng (gr)', '550', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(127, 30, 'Kích Thước Bao Bì', '24 x 16 x 1.9 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(128, 30, 'Số trang', '384', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(129, 30, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(130, 31, 'Người Dịch', 'Việt Khương', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(131, 31, 'Trọng lượng (gr)', '443', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(132, 31, 'Kích Thước Bao Bì', '20.5 x 14.5 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(133, 31, 'Số trang', '400', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(134, 31, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(135, 32, 'Người Dịch', 'Thúy Hằng, Anh Thư', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(136, 32, 'Trọng lượng (gr)', '500', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(137, 32, 'Kích Thước Bao Bì', '24 x 16 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(138, 32, 'Số trang', '480', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(139, 32, 'Hình thức', 'Bìa Mềm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(140, 33, 'Xuất Xứ Thương Hiệu', 'Trung Quốc', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(141, 33, 'Màu Mực', 'Xanh', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(142, 33, 'Chất liệu', 'Nhựa', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(143, 33, 'Trọng lượng (gr)', '20', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(144, 33, 'Kích Thước Bao Bì', '14 x 1 x 1 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(145, 34, 'Xuất Xứ Thương Hiệu', 'Thương Hiệu Đức', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(146, 34, 'Màu Mực', 'Xanh', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(147, 34, 'Chất liệu', 'Nhựa', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(148, 34, 'Trọng lượng (gr)', '20', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(149, 34, 'Kích Thước Bao Bì', '14 x 1 x 1 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(150, 35, 'Xuất Xứ Thương Hiệu', 'Thương Hiệu Nhật', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(151, 35, 'Màu Mực', 'Đỏ', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(152, 35, 'Chất liệu', 'Nhựa', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(153, 35, 'Trọng lượng (gr)', '20', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(154, 35, 'Kích Thước Bao Bì', '14 x 1 x 1 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(155, 36, 'Xuất Xứ Thương Hiệu', 'Việt Nam', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(156, 36, 'Chất liệu', 'Gỗ', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(157, 36, 'Trọng lượng (gr)', '10', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(158, 36, 'Kích Thước Bao Bì', '14 x 1 x 1 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(159, 37, 'Xuất Xứ Thương Hiệu', 'Thương Hiệu Nhật', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(160, 37, 'Màu Mực', 'Đen', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(161, 37, 'Chất liệu', 'Nhựa', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(162, 37, 'Trọng lượng (gr)', '20', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(163, 37, 'Kích Thước Bao Bì', '12.7 x 2 x 2 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(164, 38, 'Xuất Xứ Thương Hiệu', 'Thương Hiệu Nhật', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(165, 38, 'Màu Mực', 'Đen', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(166, 38, 'Chất liệu', 'Nhựa', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(167, 38, 'Trọng lượng (gr)', '20', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(168, 38, 'Kích Thước Bao Bì', '14 x 1 x 1 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(169, 39, 'Xuất Xứ Thương Hiệu', 'Việt Nam', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(170, 39, 'Màu Mực', 'Đen', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(171, 39, 'Chất liệu', 'Nhựa', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(172, 39, 'Trọng lượng (gr)', '11', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(173, 39, 'Kích Thước Bao Bì', '14.5 x 1 x 1 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(174, 40, 'Xuất Xứ Thương Hiệu', 'Thương Hiệu Đức', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(175, 40, 'Màu Mực', 'Vàng', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(176, 40, 'Chất liệu', 'Nhựa', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(177, 40, 'Trọng lượng (gr)', '20', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(178, 40, 'Kích Thước Bao Bì', '6.5 x 2.5 x 1 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(179, 41, 'Xuất Xứ Thương Hiệu', 'Trung Quốc', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(180, 41, 'Chất liệu', 'Nhựa, Kim Loại', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(181, 41, 'Trọng lượng (gr)', '55', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(182, 41, 'Kích Thước Bao Bì', '14.5 x 9.5 x 3 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(183, 42, 'Xuất Xứ Thương Hiệu', 'Thương Hiệu Tây Ban Nha', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(184, 42, 'Chất liệu', 'Giấy', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(185, 42, 'Trọng lượng (gr)', '17', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(186, 42, 'Kích Thước Bao Bì', '15.8 x 10 x 0.3 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(187, 43, 'Xuất Xứ Thương Hiệu', 'Trung Quốc', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(188, 43, 'Chất liệu', 'Nhựa', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(189, 43, 'Trọng lượng (gr)', '36', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(190, 43, 'Kích Thước Bao Bì', '33.5 x 24 x 1 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(191, 44, 'Xuất Xứ Thương Hiệu', 'Việt Nam', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(192, 44, 'Chất liệu', 'Nhựa', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(193, 44, 'Trọng lượng (gr)', '108', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(194, 44, 'Kích Thước Bao Bì', '22.5 x 8.5 x 3 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(195, 45, 'Xuất Xứ Thương Hiệu', 'Việt Nam', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(196, 45, 'Chất liệu', 'Giấy', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(197, 45, 'Trọng lượng (gr)', '52', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(198, 45, 'Kích Thước Bao Bì', '9.5 x 9.5 x 2 cm', '2025-05-15 05:49:59', '2025-05-15 05:49:59');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `product_details`
--

CREATE TABLE `product_details` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED DEFAULT NULL,
  `supplier_id` bigint(20) UNSIGNED DEFAULT NULL,
  `brand_id` bigint(20) UNSIGNED DEFAULT NULL,
  `publication_year` year(4) DEFAULT NULL,
  `author` varchar(255) DEFAULT NULL,
  `publisher` varchar(255) DEFAULT NULL,
  `color` varchar(255) DEFAULT NULL,
  `origin` varchar(255) DEFAULT NULL,
  `language` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `product_details`
--

INSERT INTO `product_details` (`id`, `product_id`, `supplier_id`, `brand_id`, `publication_year`, `author`, `publisher`, `color`, `origin`, `language`, `created_at`, `updated_at`) VALUES
(1, 1, 2, NULL, '2024', 'Emma Hạ My', 'Phụ Nữ Việt Nam', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(2, 2, 9, NULL, '2023', 'Emma Hạ My', 'Dân Trí', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(3, 3, 6, NULL, '2022', 'Dolores Redondo', 'NXB Phụ Nữ', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(4, 4, 13, NULL, '2022', 'Thảo Trang', 'NXB Phụ Nữ', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(5, 5, 6, NULL, '2024', 'Diệp Lâm Khánh', 'Phụ Nữ Việt Nam', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(6, 6, 7, NULL, '2022', 'Nguyễn Châu Nguyên', 'Mỹ Thuật', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(7, 7, 12, NULL, '2024', 'Luis Sepúlveda', 'Hội Nhà Văn', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(8, 8, 3, NULL, '2022', 'Neung In Publishing Company', 'Kim Đồng', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(9, 9, 1, NULL, '2022', 'Antoine De Saint-Exupéry', 'Kim Đồng', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(10, 10, 9, NULL, '2019', 'Xing Tao', 'Kim Đồng', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(11, 11, 1, NULL, '2020', 'Clint Emerson', 'NXB Thanh Niên', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(12, 12, 1, NULL, '2023', 'Lam', 'Dân Trí', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(13, 13, 12, NULL, '2024', 'Chaiyapat Tongkambunjong, Phanatchakorn Yoosabai', 'Văn Học', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(14, 14, 13, NULL, '2023', 'Daiki Shimizu', 'Văn Học', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(15, 15, 3, NULL, '2024', 'Doãn Hằng', 'Văn Học', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(16, 16, 12, NULL, '2023', 'Minh', 'Văn Học', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(17, 17, 9, NULL, '2022', 'Én, Thích A Tèo', 'AZ Việt Nam', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(18, 18, 6, NULL, '2023', 'Hạ Mer', 'Văn Học', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(19, 19, 1, NULL, '2019', 'Thomas Harris', 'NXB Hội Nhà Văn', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(20, 20, 9, NULL, '2023', 'R. Austin Freeman', 'Dân Trí', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(21, 21, 6, NULL, '2022', 'Lưu Hiểu Huy', 'Thanh Niên', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(22, 22, 9, NULL, '2023', 'Liêu Tiểu Đao', 'Thanh Niên', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(23, 23, 9, NULL, '2024', 'Steve Cavanagh', 'Thanh Niên', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(24, 24, 2, NULL, '2021', 'Nguyễn Cừ', 'Văn Học', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(25, 25, 9, NULL, '2020', 'José Mauro de Vasconcelos', 'NXB Hội Nhà Văn', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(26, 26, 6, NULL, '2024', 'Nguyễn Nhật Ánh', 'Trẻ', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(27, 27, 11, NULL, '2022', 'Nguyễn Nhật Ánh', 'Trẻ', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(28, 28, 4, NULL, '2021', 'Trần Đức Tuấn', 'Trẻ', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(29, 29, 13, NULL, '2022', 'Đỗ Ca Sơn, Kiều Mai Sơn', 'Kim Đồng', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(30, 30, 3, NULL, '2023', 'Phan Kế Bính', 'Kim Đồng', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(31, 31, 2, NULL, '2020', 'Napoleon Hill', 'NXB Tổng Hợp TPHCM', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(32, 32, 12, NULL, '2021', 'David M Rubenstein', 'Dân Trí', NULL, NULL, 'Tiếng Việt', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(33, 33, 5, 6, NULL, NULL, NULL, 'Xanh', 'Trung Quốc', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(34, 34, 11, 7, NULL, NULL, NULL, 'Xanh', 'Indonesia', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(35, 35, 3, 7, NULL, NULL, NULL, 'Đỏ', 'Malaysia', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(36, 36, 11, 2, NULL, NULL, NULL, 'Đỏ', 'Trung Quốc', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(37, 37, 3, 2, NULL, NULL, NULL, 'Đen', 'Malaysia', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(38, 38, 10, 1, NULL, NULL, NULL, 'Đen', 'Malaysia', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(39, 39, 12, 9, NULL, NULL, NULL, 'Đen', 'Ấn Độ', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(40, 41, 6, 5, NULL, NULL, NULL, 'Nhiều màu', 'Trung Quốc', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(41, 42, 6, 1, NULL, NULL, NULL, 'Nhiều màu', 'Trung Quốc', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(42, 43, 4, 11, NULL, NULL, NULL, 'Trắng', 'Trung Quốc', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(43, 44, 6, 10, NULL, NULL, NULL, 'Trắng', 'Trung Quốc', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(44, 45, 2, 5, NULL, NULL, NULL, 'Kem', 'Việt Nam', NULL, '2025-05-15 05:49:59', '2025-05-15 05:49:59');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `product_reviews`
--

CREATE TABLE `product_reviews` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `product_id` bigint(20) UNSIGNED DEFAULT NULL,
  `order_id` bigint(20) UNSIGNED DEFAULT NULL,
  `rating_id` bigint(20) UNSIGNED DEFAULT NULL,
  `comment` text DEFAULT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `product_reviews`
--

INSERT INTO `product_reviews` (`id`, `user_id`, `product_id`, `order_id`, `rating_id`, `comment`, `status`, `created_at`, `updated_at`) VALUES
(1, 1, 13, 23, 3, 'Ut ratione sunt aliquam officiis ut sequi. Vel occaecati cumque aut. In iusto aut est porro nam.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(2, 33, 7, 49, 4, 'Impedit doloribus non voluptas et tenetur suscipit sunt. Consequuntur et ullam alias non mollitia dolor ipsam iste.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(3, 25, 23, 1, 5, 'Et quisquam dolores deserunt doloremque quaerat rerum. Beatae libero quisquam vero non ratione. Accusantium ut quo est libero.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(4, 34, 11, 14, 2, 'Rerum illo et eligendi qui aut neque. Pariatur aliquam inventore qui sed quos ullam.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(5, 42, 16, 45, 4, 'Quae qui nobis commodi sit ab. Itaque molestiae vero necessitatibus repudiandae officia est. Dolores dolores cumque non inventore quae.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(6, 46, 16, 38, 5, 'Aut nisi non ut quasi deserunt. Consequatur velit illo rem ullam. Fugiat aliquid qui ut ex.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(7, 8, 18, 4, 5, 'Soluta cumque illum laborum velit excepturi quasi in nihil. Quo et dicta aut rerum omnis.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(8, 15, 12, 7, 3, 'Sed fuga eveniet et rerum incidunt commodi voluptas. Sint nostrum in odit minus. Voluptas sunt ad ratione veniam exercitationem eos.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(9, 5, 32, 46, 2, 'Ullam inventore non sit dicta error alias. Similique impedit porro fugiat repellat explicabo quibusdam sed.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(10, 12, 22, 22, 4, 'Quasi velit velit aut voluptas sed. Consequatur illo et corporis qui sed.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(11, 48, 20, 8, 2, 'Est omnis dolores quam. Sint possimus perspiciatis et consequatur inventore.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(12, 27, 19, 27, 5, 'Quis enim ipsa id. Voluptate molestias vitae assumenda alias deserunt. Quo corporis ea ut sint et iusto.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(13, 31, 29, 35, 5, 'Cum aut corporis nisi. Nulla eius dolorem ut aut dolore ipsum.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(14, 19, 26, 9, 2, 'Quos voluptate eveniet distinctio debitis neque explicabo. Earum iusto harum consectetur soluta esse veniam ea. Sed et maxime error eligendi tempora consequatur.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(15, 37, 10, 11, 5, 'Quo aut molestias tempore qui officia sunt. Hic dolore aspernatur sequi beatae voluptatem sapiente. Natus facilis similique cupiditate qui dignissimos.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(16, 23, 28, 26, 4, 'At incidunt omnis et quas. Doloribus autem numquam libero et suscipit inventore. Deleniti ut inventore hic maiores nemo occaecati sit.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(17, 29, 26, 9, 5, 'Repudiandae aut totam error vitae architecto eveniet. Amet illum enim ut ea et omnis accusamus. Hic voluptatem itaque iste asperiores vel.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(18, 6, 35, 30, 3, 'Ratione vero aperiam id voluptates sed. Aut sint debitis eligendi dolorem. Vero officia doloremque dolorem voluptas.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(19, 36, 33, 49, 3, 'Accusamus voluptas omnis distinctio eos eos veritatis minima. Ut rerum tenetur quisquam voluptates et id. Eum dolorem quisquam velit voluptas.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(20, 7, 43, 14, 5, 'Magnam voluptas eum nam reprehenderit consequatur iste vel. Ex nisi laborum quo omnis.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(21, 32, 19, 10, 1, 'Voluptate consequatur et quas aspernatur. Esse in a est nostrum aliquam sint earum reiciendis. Minima dignissimos rerum accusamus dolorem tenetur fuga maxime deleniti.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(22, 16, 31, 33, 5, 'Nihil voluptatem est sequi ut unde iste. Voluptatem hic aliquam qui fugiat deleniti ea quia.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(23, 26, 45, 14, 5, 'Numquam et rerum modi ipsum alias. Tempora autem odio et dolorem consequatur qui quia. Dolores quis at maxime incidunt aut.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(24, 3, 18, 27, 1, 'Perferendis deleniti dolor deleniti atque dolor fuga. Rerum veritatis est doloribus perferendis iure veritatis odit.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(25, 22, 16, 9, 2, 'Eum et natus ipsa. Doloribus sunt aut et nostrum qui veniam quasi. Tenetur animi tempore quia aut culpa quas neque.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(26, 45, 15, 4, 5, 'Esse asperiores dolor aut nihil id. Id aut fugit esse repellat rerum blanditiis.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(27, 41, 40, 12, 4, 'Et quibusdam eos velit inventore omnis explicabo. Fugit magnam id autem delectus.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(28, 2, 30, 6, 1, 'Consequatur fugit sequi aperiam cumque vel molestiae. Earum saepe perspiciatis consequatur alias esse maiores. Nesciunt consectetur et quidem nesciunt ut quae sit.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(29, 30, 36, 12, 4, 'Quis quos non consequatur. Dicta eius dolor sit voluptatum impedit.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(30, 9, 39, 28, 1, 'Odio harum consequatur delectus praesentium. Provident et rerum dicta ut.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(31, 43, 30, 47, 4, 'Nesciunt harum sed qui. Porro quo distinctio quaerat deserunt nostrum temporibus.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(32, 13, 16, 18, 3, 'Dolor nostrum pariatur aut. Illum et qui sapiente harum aut. Minima suscipit quas sit ea ut culpa.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(33, 24, 22, 6, 4, 'Et cum et voluptatem quos labore. Labore nisi est nisi ipsa. Error cumque maxime rerum sed eos.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(34, 18, 7, 15, 5, 'Ipsum consequuntur officiis animi est asperiores hic quo. Quia fugit eos eum et et ex.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(35, 17, 42, 31, 1, 'Soluta repellendus et laborum et eius soluta dolores illo. Consequatur et ea molestiae. Adipisci dolorum ut repellendus voluptatem facilis.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(36, 50, 40, 34, 3, 'Dolor reprehenderit aliquid amet totam architecto. Unde magni laboriosam vero sit. Ut illo fuga perspiciatis ipsam aut.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(37, 20, 24, 10, 5, 'Corporis nemo incidunt dolore aut magni dolor consequatur dolore. Est minima ipsam hic explicabo est rem voluptatem. Dignissimos cumque veritatis nostrum fuga sed et accusantium.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(38, 44, 17, 28, 1, 'Earum sunt dolor necessitatibus sint dolorem. Laboriosam iste aut reprehenderit.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(39, 28, 5, 34, 1, 'Consequuntur aspernatur fuga et ea enim fuga sit. Sequi et voluptatem asperiores et. Qui labore quam minus sint.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(40, 21, 35, 46, 1, 'Esse veniam quis quia doloremque sed eius consectetur. Excepturi debitis in illo ut adipisci consectetur aut. Voluptas et non ut qui veniam accusamus qui.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(41, 40, 11, 4, 2, 'Ut autem molestiae quia quaerat officiis. Ipsa alias ratione expedita ut et.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(42, 52, 21, 3, 3, 'Distinctio soluta distinctio neque non laborum sit similique. Magni ipsam enim minus quo iure voluptates autem aut. Dolorem aliquid atque consequuntur placeat tenetur facilis.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(43, 10, 11, 39, 2, 'Ipsa dolor qui unde. Earum est quae rerum quos.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(44, 4, 25, 19, 5, 'Modi eum iure iste sapiente ut et vitae. Officiis cupiditate hic accusamus nostrum dignissimos a. Recusandae vero sint architecto molestias quae velit sunt fugit.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(45, 49, 10, 35, 5, 'Sunt mollitia perferendis voluptatem hic sint facilis. Inventore assumenda architecto quis.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(46, 38, 19, 49, 4, 'Dolores sed labore qui corporis reiciendis. Ullam corporis qui alias aut vero neque recusandae. Dolorum facilis doloremque velit minus quidem aut.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(47, 39, 21, 8, 1, 'Vel expedita veniam vitae ea non. Eligendi dolorem id in dicta ea minus.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(48, 51, 39, 12, 2, 'Ut ipsam est possimus reprehenderit doloribus minima. Iste dolorem in consectetur ea nesciunt ea quia corporis. Et deserunt et deleniti in amet animi.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(49, 35, 14, 26, 5, 'Perspiciatis voluptate nulla dignissimos voluptate autem. Ea quis voluptatem ea corrupti ex qui velit dolor.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(50, 11, 32, 16, 4, 'Non dicta ullam ducimus atque commodi et architecto. Saepe et et assumenda enim aut omnis beatae.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(51, 47, 31, 43, 5, 'Dolor tempora corrupti sit sequi libero similique ut. Quod eveniet officia aperiam numquam nulla.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(52, 14, 35, 45, 2, 'Enim inventore rem dolores. Fugit neque dolores praesentium eum.', 1, '2025-05-15 05:49:59', '2025-05-15 05:49:59');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `ratings`
--

CREATE TABLE `ratings` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `score` int(11) NOT NULL,
  `label` enum('rất tệ','tệ','bình thường','tốt','rất tốt') NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `ratings`
--

INSERT INTO `ratings` (`id`, `score`, `label`, `created_at`, `updated_at`) VALUES
(1, 1, 'rất tệ', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(2, 2, 'tệ', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(3, 3, 'bình thường', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(4, 4, 'tốt', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(5, 5, 'rất tốt', '2025-05-15 05:49:58', '2025-05-15 05:49:58');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `special_events`
--

CREATE TABLE `special_events` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `img_event` varchar(255) NOT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT 1,
  `start_date` datetime DEFAULT NULL,
  `end_date` datetime DEFAULT NULL,
  `status` enum('Đang diễn ra','Chưa bắt đầu','Sắp bắt đầu','Đã kết thúc') NOT NULL DEFAULT 'Chưa bắt đầu',
  `slug` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `special_events`
--

INSERT INTO `special_events` (`id`, `name`, `description`, `img_event`, `is_active`, `start_date`, `end_date`, `status`, `slug`, `created_at`, `updated_at`) VALUES
(1, 'Tuần lễ sách thiếu nhi 2025', 'Sự kiện đọc sách dành cho thiếu nhi với nhiều trò chơi, quà tặng và giảm giá sách lên đến 50%.', 'tuan-le-sach-thieu-nhi.webp', 1, '2025-06-01 09:00:00', '2025-06-07 17:00:00', 'Chưa bắt đầu', 'tuan-le-sach-thieu-nhi-2025', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(2, 'Hội sách Mùa thu', 'Cơ hội mua sách với mức giá ưu đãi, giao lưu với tác giả nổi tiếng và tham gia tọa đàm văn học.', 'hoi-sach-mua-thu.jpg', 1, '2025-09-15 08:00:00', '2025-09-20 18:00:00', 'Chưa bắt đầu', 'hoi-sach-mua-thu', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(3, 'Black Friday - Giảm giá sách', 'Chương trình giảm giá sách cực mạnh chỉ duy nhất ngày Black Friday - giảm đến 70% toàn bộ sách.', 'black-firday.webp', 0, '2024-11-29 00:00:00', '2024-11-29 23:59:00', 'Chưa bắt đầu', 'black-friday-giam-gia-sach', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(4, 'Ngày hội đổi sách cũ lấy sách mới', 'Tham gia đổi sách đã qua sử dụng lấy sách mới miễn phí, khuyến khích văn hóa đọc và tái sử dụng sách.', 'doi-sach-cu-lay-sach-moi.webp', 1, '2025-04-22 09:00:00', '2025-04-24 17:00:00', 'Sắp bắt đầu', 'ngay-hoi-doi-sach-cu-lay-moi', '2025-05-15 05:49:59', '2025-05-15 05:49:59'),
(5, 'Sách và Cà phê – Talkshow cùng tác giả', 'Không gian mở giao lưu cùng các tác giả nổi tiếng, thảo luận về sách và cuộc sống.', 'talkshow-event.jpg', 1, '2025-04-10 15:00:00', '2025-04-12 18:00:00', 'Đã kết thúc', 'sach-va-ca-phe-talkshow', '2025-05-15 05:49:59', '2025-05-15 05:49:59');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `special_event_details`
--

CREATE TABLE `special_event_details` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `event_id` bigint(20) UNSIGNED DEFAULT NULL,
  `content` longtext DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `suppliers`
--

CREATE TABLE `suppliers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `supplier_name` varchar(255) NOT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `suppliers`
--

INSERT INTO `suppliers` (`id`, `supplier_name`, `phone`, `email`, `address`, `created_at`, `updated_at`) VALUES
(1, 'Nhà Xuất Bản Kim Đồng', '024-39364930', 'contact@kimdong.vn', '55 Quang Trung, Hoàn Kiếm, Hà Nội', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(2, 'NXB Trẻ', '028-38297806', 'nxbtre@nxbtre.com.vn', '161B Lý Chính Thắng, Phường 7, Quận 3, TP.HCM', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(3, 'Đinh Tị', '024-37955554', 'info@dinhtibooks.com.vn', 'Số 26, Ngõ 186 Khương Trung, Thanh Xuân, Hà Nội', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(4, 'Nhã Nam', '024-37956686', 'info@nhanam.vn', 'Số 59 Đỗ Quang, Trung Hòa, Cầu Giấy, Hà Nội', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(5, 'Tân Việt', '024-35145336', 'info@tanviet.vn', 'Số 2 Duy Tân, Cầu Giấy, Hà Nội', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(6, 'Thái Hà', '024-37912623', 'contact@thaihabooks.com', '53 Phạm Thận Duật, Mai Dịch, Cầu Giấy, Hà Nội', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(7, 'Penguin Books', '+44 20 7139 3000', 'info@penguinrandomhouse.com', '80 Strand, London, UK', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(8, 'Minh Long', '028-39250156', 'contact@minhlongbook.vn', 'Số 51 Trần Nhân Tôn, Quận 5, TP.HCM', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(9, 'NXB Tổng Hợp TPHCM', '028-39310394', 'info@nxbhcm.vn', '62 Nguyễn Thị Minh Khai, Quận 1, TP.HCM', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(10, 'Cty Văn Hóa Sách Việt', '028-39295550', 'contact@sachviet.vn', '87 Nguyễn Văn Trỗi, Phú Nhuận, TP.HCM', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(11, 'AZ Việt Nam', '024-38395533', 'info@azvietnam.vn', 'Số 10, Nguyễn Xiển, Thanh Xuân, Hà Nội', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(12, 'Văn Phòng Phẩm Stabilo', '028-38775900', 'info@stabilo.vn', '28 Lý Chính Thắng, Quận 3, TP.HCM', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(13, 'Cty Văn Hóa Việt Thư', '024-37286688', 'contact@vietthu.vn', 'Số 23 Nguyễn Chí Thanh, Ba Đình, Hà Nội', '2025-05-15 05:49:58', '2025-05-15 05:49:58');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `username` varchar(255) NOT NULL,
  `gender` tinyint(1) DEFAULT NULL,
  `birthday` date DEFAULT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `role` varchar(255) NOT NULL DEFAULT 'customer',
  `phone` varchar(255) DEFAULT NULL,
  `fb_id` varchar(255) DEFAULT NULL,
  `gg_id` varchar(255) DEFAULT NULL,
  `status` enum('active','is_active') NOT NULL DEFAULT 'is_active',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `users`
--

INSERT INTO `users` (`id`, `username`, `gender`, `birthday`, `email`, `password`, `role`, `phone`, `fb_id`, `gg_id`, `status`, `created_at`, `updated_at`) VALUES
(1, 'admin', 1, '1999-09-09', 'admin@gmail.com', '$2y$10$LV6JEuzCyKY/UIk2236gJusnqGTUUfT/zwLSwQFIgkxjo7xsVTiAa', 'admin', '0987753456', NULL, NULL, 'active', '2025-05-15 05:49:54', '2025-05-15 05:49:54'),
(2, 'Nguyễn Quang Huy', 1, '2007-04-18', 'khachhang@gmail.com', '$2y$10$Tk6GJg5HPBTtVUwHRqilm.OZ2xkhu8GGiE2au7q067Mi3QSG8F/Qm', 'customer', '0987753456', NULL, NULL, 'active', '2025-05-15 05:49:54', '2025-05-15 05:49:54'),
(3, 'Noemi Hintz', 0, '2018-08-23', 'green.alyce@example.net', '$2y$10$Pu5PPIXlPdsLGUud06Iwzevwp2JYHUxhohMWOIOoyY6JfOoQIioHa', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(4, 'Dr. Kathleen O\'Keefe DVM', 1, '2002-08-28', 'pouros.cecil@example.com', '$2y$10$YVauY3NprgqYqeLis4bk6.KfhxHZ8xVBrHjwotdyW2ghPANSf2n4y', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(5, 'Nona Schmeler', 0, '2006-06-05', 'ckoch@example.net', '$2y$10$Eje.3pOZ2MTfHUo5SFDI7.nEnAIRtDkn9Q/RlGHkGkUmlaeEEGNBq', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(6, 'Clara Dach', 0, '2019-05-05', 'elyssa.moore@example.net', '$2y$10$0vYFxGLiWvqyiD3OdYgIkuEXr/O4BoTHj85Sz.D.N/CB8Qo6x381.', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(7, 'Melisa Larkin', 1, '1975-07-30', 'ewitting@example.net', '$2y$10$YCr0.pZBzsozU4JoMZV/M.IYY7cH5FJ5f94gvox4E8wJcOqwsrZ7W', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(8, 'Ariel Dooley', 0, '2012-11-11', 'cbruen@example.net', '$2y$10$RNcMAkooPEIlVFidxpMfz.REMXuOaPRgA72ezcukF6ytNeI3MFXQS', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(9, 'Mavis Herman', 0, '2016-12-18', 'kristopher.lang@example.com', '$2y$10$aN/.Zk2VrvqM9AbxEDH.Lu2/K4oHh4nN3DNHfxMbzcOdz174jhdDi', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(10, 'Lavon Spinka', 0, '2015-10-01', 'orie64@example.com', '$2y$10$LlvCJAHEmPOavCJbzlgGUeEG4RJKvV8/jR4MdwB3ZJcSlLrHgGl0a', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(11, 'Shanon Nitzsche', 0, '2022-11-24', 'wunsch.kayden@example.com', '$2y$10$s5KzcmO9YM1tASIrSzffW.pp12t9r01ebXQWKGJBWtYg1p5tlxwMi', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(12, 'Prof. Karolann Herzog', 0, '2004-10-30', 'cloyd57@example.com', '$2y$10$TVtP4RbTgbkqTAvqHbp6o.mRhLu/JmWwFEjHiwidRAR/kE37nbhOu', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(13, 'Constantin Blick', 1, '2022-09-11', 'lexi41@example.net', '$2y$10$wfaNiZiwC17CtcPkbUi2UOoEtbOqgmhTIhhNOB/p/Wmon8aAliO9O', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(14, 'Orie Swaniawski', 1, '2015-02-27', 'zackery.hamill@example.com', '$2y$10$6pCv8rXJv8q9zK1nsykvROH4WL5arzTy1hdEQX4mtLtLV1QPp//7u', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(15, 'Judd Nienow', 1, '1974-01-25', 'christelle98@example.net', '$2y$10$OpDDeuAZ8xOWP6H/7rlB1.IE18EpNG9Gcdw52.sEy8wdBokq0iQ1C', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(16, 'Nellie Greenfelder', 0, '2011-07-21', 'garret.harris@example.com', '$2y$10$gtjdm/N1dMuhMcClOCnpBObW6shNrX/JIV/94PcNqeipJLAQxoYlK', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(17, 'Mr. Troy Corkery PhD', 1, '1995-05-17', 'marilie29@example.net', '$2y$10$R8EEkOmNaqA7Mjn86.Xb4.3Ogf4UdsteLd/o0s6s6edjnWdxxb8RO', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(18, 'Art Swaniawski', 0, '1990-04-08', 'lydia94@example.com', '$2y$10$GxLuPPoYftuhC/BHC53sXeAbpUr07QHba/PdyDIfHd62bNCM0V4ay', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(19, 'Prof. Ivah Collins', 1, '1984-12-02', 'dagmar22@example.net', '$2y$10$oKG56ZRYp8cx51qvoXwyROJi/AkzkTkoG/esRSpNRUOv2MTF7KjO6', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(20, 'Prof. Heloise Wehner I', 1, '1989-06-03', 'mathias.brown@example.net', '$2y$10$6DyfnSpBA3Kwr8eZjFHoFuRO7mVSRfiSwlYk7HmIE91geRUeNQSf6', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(21, 'Barton Rogahn', 0, '2021-09-03', 'mpredovic@example.net', '$2y$10$kDFi6odZY4Rb0O5ZcEp9UO/YXDKSizQAZ5saynKZnTzrJkJM.rc0q', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(22, 'Dr. Bertha Douglas', 0, '2000-06-20', 'hhartmann@example.com', '$2y$10$LjNydr4JvtxBgDPxotpFF.dCnJRQqsCl9Tw4R8cQA6GxG0tEdwMPm', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(23, 'Chelsea Wisoky', 1, '1977-07-23', 'dpredovic@example.net', '$2y$10$f9rQi9niWKEXzQhzwAr3oew.HliV8ht3eD/sdkeP.Rx.KU/NXKze6', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(24, 'Dr. Noemi Hirthe', 0, '2010-01-03', 'luigi73@example.com', '$2y$10$1OfNEY132d12e6DIAkZs6OT7aADzZuIvB6LpSieT6GB866KwM1tg6', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(25, 'Ezequiel Pagac', 0, '1985-04-21', 'autumn75@example.net', '$2y$10$R1D6M5oDf4CWByAWf27syOCmgE7zXZ9esmrkOUyeUQEhDfDQ/j.fO', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(26, 'Lyla Carroll', 0, '1972-10-11', 'gleason.cale@example.org', '$2y$10$gcTcrKgpheWMEj1NQ6GjyOl1gXG1b1QjLxxPHmdAIXLEK6euEhcRu', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(27, 'Mrs. Kari Hackett PhD', 0, '2011-03-09', 'cordell.koss@example.net', '$2y$10$d.PXz1BJayBQTseFk9sBou3WWXNvIxLede4vdLxSJYqWtfyMYAVbm', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(28, 'Dante Rutherford II', 1, '2006-02-26', 'mozelle.schultz@example.org', '$2y$10$eiz7Gm2ogw8r6qtpA4kx5OMVFigQ6xYhv/KIZn/0nsQPxAW0glfW.', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(29, 'Jany Larkin', 0, '2017-02-24', 'elwin.wilkinson@example.org', '$2y$10$mJBRvtl.4L7iGuC1NjoN4ei0dtFnDZ6BHRZE3VJAmroUIdJKDi/l6', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(30, 'Alayna Will', 0, '1972-04-28', 'kilback.ayana@example.net', '$2y$10$fnoenGkFjHUuiRsh8nGCxOPoNFCOYB/wnGKm2pdOzKbG.7DonkFHq', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(31, 'Estefania Beer', 1, '2019-11-01', 'corwin.nayeli@example.com', '$2y$10$4PEbGv3da6aHYFFW0U3YE.vio0K8jGgSZF5STuexFbYkvmQdikdQO', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(32, 'Prof. Walter Harber', 1, '1983-12-03', 'finn.tremblay@example.net', '$2y$10$c.c8Lc5pmOhdLdtMuzfhnOcDOmxH3IXXS9f4ouFPZaT2to9lds1Am', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(33, 'Mrs. Aliza Gulgowski', 0, '1982-04-14', 'austin18@example.org', '$2y$10$6JEEfPeXpg4Q0D16YV6G/uRcukv2FiluM128L8lFlp5.3M7l7YG9q', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(34, 'Mr. Mathew Stiedemann', 0, '1981-10-29', 'beahan.barrett@example.org', '$2y$10$ZuJYRGriZhm3ieBC2CBH1uNxXepBXcRWhSITv0EBLY3pajdFP1xLS', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(35, 'Miss Ada Leuschke', 0, '1973-11-21', 'rwuckert@example.com', '$2y$10$HT6jD1QdxKlpm/EMJCYtE.FO9CeqMsNrQh70Eaih0btVAUOkoJMbO', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(36, 'Frederique Daniel', 1, '2005-09-22', 'emie.fisher@example.net', '$2y$10$hFkfBzfIK/kvBQHBsUQcfOAo2W9/AGkSGXAGVH/zO81wF55re00k.', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(37, 'Anya Koepp PhD', 1, '2018-12-29', 'dominic.krajcik@example.com', '$2y$10$xhzX3GrL0YZAcqV6DOwKYu7zHyKNiIbnK9s.a7KrBzQ5esFvFg.de', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(38, 'Emmanuel Robel', 0, '1991-10-15', 'rahul.hahn@example.com', '$2y$10$8mNi00tQt3om3kjzwXWBgOI9DsFD0p3ifldLCesO3agqr0NelzTDm', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(39, 'Dexter Cummerata', 0, '2021-02-27', 'rosendo99@example.net', '$2y$10$qJEX5gh.t8nnOUfMAacJD.e89/0GqUimdsT6ZysRzsJ7dfimySXli', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(40, 'Lora Schoen', 0, '2005-08-16', 'muller.alejandra@example.net', '$2y$10$/Pv3i2jbdZO2U2FZmEIJQeh6FNZ13NXbT4MyCFlGfGRotiUhwDI5S', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(41, 'Nikita Ward', 1, '2018-05-29', 'jacobs.akeem@example.org', '$2y$10$qxgz9vxRQpQULBnmyqU6Ce.CkW1bAYhQuO0EZSdY.lG.dpV8S0OVm', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(42, 'Meda Abernathy', 1, '2006-01-16', 'bechtelar.bernita@example.net', '$2y$10$3DlpI8UUx4f7tUC4upw.H.UqilUIL7W4EjoD5KXHnNLjn..UcBnYW', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(43, 'Felicita Bartoletti', 0, '2012-01-11', 'leonardo59@example.com', '$2y$10$j7Y7UNIdV1Jr6fYFmTRek.Ay7LtMjqfHCWKRU51GWplOZ4sEDW5X.', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(44, 'Ms. Marcelina Adams', 0, '2015-12-03', 'mohamed.west@example.com', '$2y$10$oxhLKb58nV1tnvFf1tahburcQojg3kcEytVG1X2z2NSHeUnwjANfG', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(45, 'Ms. Emely Kessler', 0, '2012-11-14', 'ivory.koelpin@example.net', '$2y$10$/Opsd1n0tHeOF6JsDm34DOeUn25CzrXNQErOXqc71U3pqFAeCf.q2', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(46, 'Monte Durgan', 0, '2015-08-07', 'brown.huel@example.com', '$2y$10$B5Rk./ZRfjee/HWWsEcgbuUTa1/72.GXlN/oGry263yVwnUBhUWu2', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(47, 'Giovanna Rice V', 1, '1973-08-16', 'xzavier90@example.org', '$2y$10$s5pJthDkpnZEIywquCT5/OCj3gbhoU7kRWZvIDi8cYVABhmKlboUu', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(48, 'Dr. Janick Nolan Jr.', 1, '1978-12-08', 'clyde.kreiger@example.com', '$2y$10$RdznacFCEnPtnml7hL4h4e14Q6gSjohPIOp7lU26BqKobVYX/mkXK', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(49, 'Bria Rau', 1, '1996-07-31', 'prohaska.ivy@example.net', '$2y$10$3kOuDtNoXzbMcvaaIWT1ZuUdNvTD3gzX8oCCTqZ.oq4db6Jbruju.', 'customer', NULL, NULL, NULL, 'is_active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(50, 'Carissa Ernser', 1, '1993-11-19', 'marks.daren@example.net', '$2y$10$w3hWEKwzHLNA0rp3ImnBu.sbCEyXu3cGhRKDHWT4TBmaUHySxVJVa', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(51, 'Alycia Hoppe', 0, '2009-01-01', 'rrutherford@example.com', '$2y$10$tYYAJgYBZKAH4TGD8ot.3ulK5JCWa8.qQ7z7MT4lySw3Kuu8aXrXu', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(52, 'Ms. Kassandra Schinner', 0, '1995-10-26', 'oherman@example.com', '$2y$10$xOzmcvdnQNcfpC1VH/ZO6.UvctpgWB1fRDty3d7oMfvl36wYEi.wK', 'customer', NULL, NULL, NULL, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(53, 'Nguyễn Quang Huy', NULL, NULL, 'huyazgame@gmail.com', '$2y$10$iv/C2cxDT1wJ9HOtL7FoNOkGrp.iPjuRHUv4sXgW/77VXjlXgFe/q', 'customer', NULL, '1418669165933239', '110873458565860878224', 'active', '2025-05-15 08:05:57', NULL);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `user_vouchers`
--

CREATE TABLE `user_vouchers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `voucher_id` bigint(20) UNSIGNED DEFAULT NULL,
  `used` tinyint(1) NOT NULL DEFAULT 0,
  `used_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `vnpay_payments`
--

CREATE TABLE `vnpay_payments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `order_id` bigint(20) UNSIGNED NOT NULL,
  `vn_pay` text NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `vouchers`
--

CREATE TABLE `vouchers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `code` varchar(255) NOT NULL,
  `type` enum('discount','freeship') NOT NULL,
  `discount_type` enum('fixed','percentage') NOT NULL,
  `discount_value` decimal(10,2) NOT NULL,
  `min_order_value` decimal(10,2) NOT NULL DEFAULT 0.00,
  `max_discount_amount` decimal(10,2) DEFAULT NULL,
  `start_date` date NOT NULL,
  `end_date` date NOT NULL,
  `quantity` int(11) NOT NULL DEFAULT 0,
  `status` enum('active','expired','disabled') NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `vouchers`
--

INSERT INTO `vouchers` (`id`, `name`, `description`, `code`, `type`, `discount_type`, `discount_value`, `min_order_value`, `max_discount_amount`, `start_date`, `end_date`, `quantity`, `status`, `created_at`, `updated_at`) VALUES
(1, 'Giảm giá 100K', 'Áp dụng cho đơn hàng từ 500K', 'DISCOUNT100', 'discount', 'fixed', 100000.00, 500000.00, NULL, '2025-02-01', '2025-03-01', 100, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(2, 'Giảm 10%', 'Giảm 10% tối đa 50K', 'SALE10', 'discount', 'percentage', 10.00, 200000.00, 50000.00, '2025-02-05', '2025-03-05', 50, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(3, 'Voucher VIP', 'Dành riêng cho khách hàng VIP', 'VIP50', 'discount', 'fixed', 500000.00, 2000000.00, NULL, '2025-02-10', '2025-03-10', 10, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(4, 'Tết Nguyên Đán', 'Giảm 20% tối đa 100K', 'TET2025', 'discount', 'percentage', 20.00, 300000.00, 100000.00, '2025-02-01', '2025-02-20', 200, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58'),
(5, 'Black Friday Deal', 'Siêu giảm giá Black Friday', 'BF2025', 'discount', 'fixed', 150000.00, 800000.00, NULL, '2025-11-25', '2025-11-30', 500, 'active', '2025-05-15 05:49:58', '2025-05-15 05:49:58');

--
-- Chỉ mục cho các bảng đã đổ
--

--
-- Chỉ mục cho bảng `banner_advertisings`
--
ALTER TABLE `banner_advertisings`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `brands`
--
ALTER TABLE `brands`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `carts`
--
ALTER TABLE `carts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `carts_user_id_foreign` (`user_id`),
  ADD KEY `carts_product_id_foreign` (`product_id`);

--
-- Chỉ mục cho bảng `catalogs`
--
ALTER TABLE `catalogs`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `customer_addresses`
--
ALTER TABLE `customer_addresses`
  ADD PRIMARY KEY (`id`),
  ADD KEY `customer_addresses_user_id_foreign` (`user_id`);

--
-- Chỉ mục cho bảng `feedbacks`
--
ALTER TABLE `feedbacks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `feedbacks_user_id_foreign` (`user_id`);

--
-- Chỉ mục cho bảng `feedback_answers`
--
ALTER TABLE `feedback_answers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `feedback_answers_feedback_id_foreign` (`feedback_id`);

--
-- Chỉ mục cho bảng `flashsales`
--
ALTER TABLE `flashsales`
  ADD PRIMARY KEY (`id`),
  ADD KEY `flashsales_product_id_foreign` (`product_id`);

--
-- Chỉ mục cho bảng `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`),
  ADD KEY `orders_user_id_foreign` (`user_id`);

--
-- Chỉ mục cho bảng `order_details`
--
ALTER TABLE `order_details`
  ADD PRIMARY KEY (`id`),
  ADD KEY `order_details_order_id_foreign` (`order_id`),
  ADD KEY `order_details_product_id_foreign` (`product_id`);

--
-- Chỉ mục cho bảng `order_reviews`
--
ALTER TABLE `order_reviews`
  ADD PRIMARY KEY (`id`),
  ADD KEY `order_reviews_user_id_foreign` (`user_id`),
  ADD KEY `order_reviews_order_id_foreign` (`order_id`),
  ADD KEY `order_reviews_rating_id_foreign` (`rating_id`);

--
-- Chỉ mục cho bảng `order_shipping_addresses`
--
ALTER TABLE `order_shipping_addresses`
  ADD PRIMARY KEY (`id`),
  ADD KEY `order_shipping_addresses_order_id_foreign` (`order_id`);

--
-- Chỉ mục cho bảng `otp_verifies`
--
ALTER TABLE `otp_verifies`
  ADD PRIMARY KEY (`id`),
  ADD KEY `otp_verifies_user_id_foreign` (`user_id`);

--
-- Chỉ mục cho bảng `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Chỉ mục cho bảng `policies`
--
ALTER TABLE `policies`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `products_catalog_id_foreign` (`catalog_id`);

--
-- Chỉ mục cho bảng `product_attributes`
--
ALTER TABLE `product_attributes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `product_attributes_product_id_foreign` (`product_id`);

--
-- Chỉ mục cho bảng `product_details`
--
ALTER TABLE `product_details`
  ADD PRIMARY KEY (`id`),
  ADD KEY `product_details_product_id_foreign` (`product_id`),
  ADD KEY `product_details_supplier_id_foreign` (`supplier_id`),
  ADD KEY `product_details_brand_id_foreign` (`brand_id`);

--
-- Chỉ mục cho bảng `product_reviews`
--
ALTER TABLE `product_reviews`
  ADD PRIMARY KEY (`id`),
  ADD KEY `product_reviews_user_id_foreign` (`user_id`),
  ADD KEY `product_reviews_product_id_foreign` (`product_id`),
  ADD KEY `product_reviews_order_id_foreign` (`order_id`),
  ADD KEY `product_reviews_rating_id_foreign` (`rating_id`);

--
-- Chỉ mục cho bảng `ratings`
--
ALTER TABLE `ratings`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `special_events`
--
ALTER TABLE `special_events`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `special_events_slug_unique` (`slug`);

--
-- Chỉ mục cho bảng `special_event_details`
--
ALTER TABLE `special_event_details`
  ADD PRIMARY KEY (`id`),
  ADD KEY `special_event_details_event_id_foreign` (`event_id`);

--
-- Chỉ mục cho bảng `suppliers`
--
ALTER TABLE `suppliers`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- Chỉ mục cho bảng `user_vouchers`
--
ALTER TABLE `user_vouchers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_vouchers_user_id_foreign` (`user_id`),
  ADD KEY `user_vouchers_voucher_id_foreign` (`voucher_id`);

--
-- Chỉ mục cho bảng `vnpay_payments`
--
ALTER TABLE `vnpay_payments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `vnpay_payments_order_id_foreign` (`order_id`);

--
-- Chỉ mục cho bảng `vouchers`
--
ALTER TABLE `vouchers`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `vouchers_code_unique` (`code`);

--
-- AUTO_INCREMENT cho các bảng đã đổ
--

--
-- AUTO_INCREMENT cho bảng `banner_advertisings`
--
ALTER TABLE `banner_advertisings`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `brands`
--
ALTER TABLE `brands`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT cho bảng `carts`
--
ALTER TABLE `carts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;

--
-- AUTO_INCREMENT cho bảng `catalogs`
--
ALTER TABLE `catalogs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT cho bảng `customer_addresses`
--
ALTER TABLE `customer_addresses`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT cho bảng `feedbacks`
--
ALTER TABLE `feedbacks`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `feedback_answers`
--
ALTER TABLE `feedback_answers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `flashsales`
--
ALTER TABLE `flashsales`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT cho bảng `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT cho bảng `orders`
--
ALTER TABLE `orders`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;

--
-- AUTO_INCREMENT cho bảng `order_details`
--
ALTER TABLE `order_details`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=95;

--
-- AUTO_INCREMENT cho bảng `order_reviews`
--
ALTER TABLE `order_reviews`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `order_shipping_addresses`
--
ALTER TABLE `order_shipping_addresses`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;

--
-- AUTO_INCREMENT cho bảng `otp_verifies`
--
ALTER TABLE `otp_verifies`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `policies`
--
ALTER TABLE `policies`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `products`
--
ALTER TABLE `products`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=46;

--
-- AUTO_INCREMENT cho bảng `product_attributes`
--
ALTER TABLE `product_attributes`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=199;

--
-- AUTO_INCREMENT cho bảng `product_details`
--
ALTER TABLE `product_details`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=45;

--
-- AUTO_INCREMENT cho bảng `product_reviews`
--
ALTER TABLE `product_reviews`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=53;

--
-- AUTO_INCREMENT cho bảng `ratings`
--
ALTER TABLE `ratings`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT cho bảng `special_events`
--
ALTER TABLE `special_events`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT cho bảng `special_event_details`
--
ALTER TABLE `special_event_details`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `suppliers`
--
ALTER TABLE `suppliers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT cho bảng `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;

--
-- AUTO_INCREMENT cho bảng `user_vouchers`
--
ALTER TABLE `user_vouchers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `vnpay_payments`
--
ALTER TABLE `vnpay_payments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT cho bảng `vouchers`
--
ALTER TABLE `vouchers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- Các ràng buộc cho các bảng đã đổ
--

--
-- Các ràng buộc cho bảng `carts`
--
ALTER TABLE `carts`
  ADD CONSTRAINT `carts_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `carts_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `customer_addresses`
--
ALTER TABLE `customer_addresses`
  ADD CONSTRAINT `customer_addresses_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `feedbacks`
--
ALTER TABLE `feedbacks`
  ADD CONSTRAINT `feedbacks_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `feedback_answers`
--
ALTER TABLE `feedback_answers`
  ADD CONSTRAINT `feedback_answers_feedback_id_foreign` FOREIGN KEY (`feedback_id`) REFERENCES `feedbacks` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `flashsales`
--
ALTER TABLE `flashsales`
  ADD CONSTRAINT `flashsales_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `orders`
--
ALTER TABLE `orders`
  ADD CONSTRAINT `orders_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `order_details`
--
ALTER TABLE `order_details`
  ADD CONSTRAINT `order_details_order_id_foreign` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `order_details_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `order_reviews`
--
ALTER TABLE `order_reviews`
  ADD CONSTRAINT `order_reviews_order_id_foreign` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `order_reviews_rating_id_foreign` FOREIGN KEY (`rating_id`) REFERENCES `ratings` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `order_reviews_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `order_shipping_addresses`
--
ALTER TABLE `order_shipping_addresses`
  ADD CONSTRAINT `order_shipping_addresses_order_id_foreign` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `otp_verifies`
--
ALTER TABLE `otp_verifies`
  ADD CONSTRAINT `otp_verifies_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `products`
--
ALTER TABLE `products`
  ADD CONSTRAINT `products_catalog_id_foreign` FOREIGN KEY (`catalog_id`) REFERENCES `catalogs` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `product_attributes`
--
ALTER TABLE `product_attributes`
  ADD CONSTRAINT `product_attributes_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `product_details`
--
ALTER TABLE `product_details`
  ADD CONSTRAINT `product_details_brand_id_foreign` FOREIGN KEY (`brand_id`) REFERENCES `brands` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `product_details_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `product_details_supplier_id_foreign` FOREIGN KEY (`supplier_id`) REFERENCES `suppliers` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `product_reviews`
--
ALTER TABLE `product_reviews`
  ADD CONSTRAINT `product_reviews_order_id_foreign` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `product_reviews_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `product_reviews_rating_id_foreign` FOREIGN KEY (`rating_id`) REFERENCES `ratings` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `product_reviews_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `special_event_details`
--
ALTER TABLE `special_event_details`
  ADD CONSTRAINT `special_event_details_event_id_foreign` FOREIGN KEY (`event_id`) REFERENCES `special_events` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `user_vouchers`
--
ALTER TABLE `user_vouchers`
  ADD CONSTRAINT `user_vouchers_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `user_vouchers_voucher_id_foreign` FOREIGN KEY (`voucher_id`) REFERENCES `vouchers` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `vnpay_payments`
--
ALTER TABLE `vnpay_payments`
  ADD CONSTRAINT `vnpay_payments_order_id_foreign` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
